// 第三方游戏相关
class Game3Config {
  // 图标处理
  static Map<String, List<int>> gameArr = {
    // 目前生效17个真人场馆
    'video': [
      60,
      345,
      400,
      402,
      412,
      420, // IG视讯 设计图没有（没有的暂时不考虑）
      421,
      423,
      572,
      710,
      924,
      980,
      1309,
      1312,
      1313,
      1314,
      1317,
      1322,
    ],
    // 目前生效13个体育场馆
    'tiyu': [
      342,
      409,
      418, // 胜博体育 设计图没有（没有的暂时不考虑）
      422,
      490, // S128斗鸡 设计图没有（没有的暂时不考虑）
      570,
      706,
      750,
      925,
      930,
      931,
      981,
      1031,
      1308,
      1316,
    ],
    // 目前生效30个电子场馆
    'dz': [
      340,
      343,
      403,
      405,
      413,
      414,
      415,
      416,
      // 507, // EVOPlay电子 同步play_info 屏蔽， 不要了
      508,
      571, // PG电子(OLD)设计图没有（没有的暂时不考虑）
      593, // UPG电子 设计图没有（没有的暂时不考虑）
      707,
      711,
      926,
      929,
      938,
      939,
      960,
      961, // VT电子 设计图没有（没有的暂时不考虑）
      983,
      1305,
      1306,
      1307,
      1310,
      1311,
      1315,
      1318, // PGSOFT电子 设计图没有（没有的暂时不考虑）
      1319, // EVOPLAY电子 设计图没有（没有的暂时不考虑）
      1320,
      1321,
      1323,
      1324,
      1325,
      1380,
      1382
    ],
    // 目前生效17个棋牌场馆
    'qipai': [
      297,
      299,
      382,
      388,
      391, // 天美棋牌 设计图没有（没有的暂时不考虑）
      393,
      394,
      401,
      404,
      417,
      506,
      509, // kingpoker 设计图没有（没有的暂时不考虑）
      709,
      744, // 赢博棋牌
      745,
      746,
      927,
      928,
      1383,
      1033,
      1036,
    ],
    // 目前生效10个捕鱼场馆
    'buyu': [
      381,
      383,
      390,
      396,
      397,
      399,
      407,
      408,
      708,
      747,
      749, // 未知 设计图没有（没有的暂时不考虑）
    ],

    // 这玩意没搞懂， 真人/电子/棋牌的场馆ID都含有 ？？？
    'glg': [
      340,
      394,
      401,
      405,
      415,
      297,
      299,
      343,
      507,
      508,
      509,
      417,
      571,
      572,
      927,
      928
    ],
    // DB彩票
    'cp': [1385],
    'qukuailian': [1390, 1391]
  };
}
