
//todo: 0109.娱乐城投注页， 接口：
// 娱乐城、体育下面的所有投注、风云榜接口
// 查所有投注：page、page_size、type参数就好，type传0，就是所有投注的一个滚动效果
// 查风云榜：同上，type传1，一天内投注金额最大的在前

// 2、串关的情况下如果有多个错误提示同时满足，则按优先级提示：
// <1>、该场馆暂不支持您所选的币种；
// <2>、同一场赛事的多个投注项不能组合为复式投注；
// <3>、您有暂停的投注项；
// <4>、您有不支持复式投注的投注项；
// <5>、赔率小于1.10的投注项不能组合为复式投注
// <6>、同时最多只能添加10个投注项；
// <7>、赔率已变更，您需先接受赔率更改方可进行投注；
// <8>、您的账户余额不足；
// <9>、不支持小数位超过两位的投注金额；
// <10>、只支持10的整数倍的投注金额；
// <11>、不支持小数位超过5位的投注金额；
// <12>、获取投注信息失败；

///todo: 0113.member/bet/list
// 游戏icon以前写死的，现在接口给参数了
// 用在 所有投注 和 风云榜