class HelpCenterConstants {
  static List<HelpCenterBean> helpList = [
    HelpCenterBean(title: "开户协议", text: """ <ul  class="g-content">
        <li  class="item">
          <div  class="conent">
            <p  class="title">导言</p>
            <p >欢迎您使用本公司提供的服务！</p>
            <p> 本协议是您与本公司之间关于您使用本公司平日服务所订立的协议，为使用本公司平台服务，您应当阅读并遵守《开户协议》等规则。请您务必审慎阅读，充分理解各条款内容，特别是免除或者限制责任的条款，以及开通或使用某项服务的单独协议，并选择接受或不接受。除非您已阅读并接受本协议所有条款，否则您无权使用本公司服务。您的下载，安装，使用，登录等行文即视为您已阅读并同意本协议的约束。您保证您在使用本服务时已满18周岁，且具有完全的民事行为能力。</p>
          </div>
        </li>
        <li  class="item">
          <div  class="conent">
            <p  class="title">相关定义</p>
            <p  class="subtitle">1.用户</p>
            <p  class="fs-28">指在本公司平台注册登记，并得到本公司平台在认可，有资格享受本公司的注册会员。</p>
            <p  class="subtitle">2.游戏</p>
            <p  class="fs-28">指注册的用户可在本站游戏彩票，视讯，电子，体育，棋牌等，并且对所游戏的项目拥有完整的奖金获得权利。</p>
            <p  class="subtitle">3.用户资料</p>
            <p  class="fs-28">指用户在注册时提供的个人信息，包括：用户名，注册账户密码，银行卡账号，用户真实姓名等。</p>
          </div>
        </li>
        <li  class="item">
          <div  class="conent">
            <p  class="title">本协议服务范围</p>
            <p  class="subtitle welcome">提供游戏平台</p>
            <p  class="subtitle welcome">提供游戏平台相关资讯</p>
            <p  class="subtitle welcome">提供真实现场信息交互平台</p>
            <p  class="subtitle welcome">提供在线预付支付结算服务。</p>
            <p  class="subtitle welcome">本协议服务范围不包括向注册会员提供电脑终端及其附属设备，网络和通信等资源</p>
          </div>
        </li>
        <li  class="item">
          <div  class="conent">
            <p  class="title">用户权力</p>
            <p  class="subtitle">1.账户管理权</p>
            <p  class="fs-28">用户有权随时查询用户资料，并可对用户名，用户真实姓名以外的信息进行修改。</p>
            <p  class="subtitle">2.免费使用权</p>
            <p  class="fs-28">用户有权免费使用本公司投注系统以及免费获得相关游戏项目资讯。</p>
            <p  class="subtitle">3.彩票，视讯，体育，电子，棋牌查询权，网络和通信等资源</p>
            <p  class="fs-28">用户通过本公司下注成功后，有权免费在本公司查询所游戏项目的状态。</p>
            <p  class="subtitle">4.奖金获得权</p>
            <p  class="fs-28">用户通过本公司游戏下注成功的，若游戏中奖，用户有权获得相应奖金。</p>
            <p  class="subtitle">5.账户核查权</p>
            <p  class="fs-28">用户可以随时对账户进行资金余额核查。</p>
            <p  class="subtitle">6.申请提款权</p>
            <p  class="fs-28">
              用户在任何时间都可对自己的余额申请提款，本公司在核对用户资金来源正常的情况下，在收到提款请求3个工作日内将用户预付款中需提取的款项转账到用户注册的银行账户上。用户提款转账所产生的银行费用由用户承担。当用户余额小于转账所需的银行费用时，请及时联系客服处理。
            </p>
          </div>
        </li>
        <li  class="item">
          <div  class="conent">
            <p  class="title">用户义务</p>
          <p  class="subtitle">1.全面遵守本协议的义务</p>
          <p  class="fs-28">在注册登记成为本公司用户之前，须认真阅读，理解本协议各条款，一经注册成功即视为同意本协议全部条款，用户有义务全部遵守本协议。</p>
          <p  class="subtitle">2.如实提供用户资料义务</p>
          <p  class="fs-28">
            为保障用户的合法权益，避免在中奖时出现用户注册资料与真实情况不符导致兑奖不能等情况，请用户按照真实，全面，准确的原则提供用户资料。因用户资料的不真实，不全面，不准确造成不能兑奖，不能提款等情况，由用户承担全部责任。在申请提款至用户银行卡的银行费用由用户承担。
          </p>
          <p  class="subtitle">3.对应注册义务</p>
          <p  class="fs-28">
            用户通过本公司注册成功后，严谨任何形式的重复注册及多次恶意注册，因此而造成的一切后果，由用户自行承担。同时，为保证用户的安全性，用户应以一个银行卡账号对应一个用户真实姓名，因银行卡账号与用户真实姓名不能一一对应而产生的不利后果，由用户自行承担。
          </p>
          <p  class="subtitle">4.保存用户名义务</p>
          <p  class="fs-28"> 为保护用户账户的安全性，用户名，用户真实姓名，银行卡号一经注册确认后，不得再行更改。</p>
          <p  class="subtitle">5.保护账户资料的义务</p>
          <p  class="fs-28">
            用户账户资料包括用户密码，个人账户以及用户账号操作所需的资料。用户务必对其账户资料自行保密，以免账户资料被盗用或篡改。因用户保护不周导致账户资料被盗用或篡改而给用户造成的任何损失及法律责任由用户自行承担。</p>
          <p  class="subtitle">6.遵守网络安全管理的义务</p>
          <p  class="fs-28">
            用户不得利用本公司制作，复制和传播下列信息：<br >
            一、煽动抗拒、破坏宪法和法律、行政法规实施的。<br >
            二、煽动颠覆国家政权,推翻社会主义制度的。<br >
            三、煽动分裂国家、破坏国家统一的。<br >
            四、煽动民族仇恨、民族歧视，破坏民族团结的。<br >
            五、捏造或者歪曲事实,散布谣言,扰乱社会秩序的。<br >
            六、宣扬迷信、淫秽、色情、赌博、暴力、凶杀、恐 怖、教唆犯罪的。<br >
            七、公然侮辱他人或者捏造事实诽谤他人的，或者进行其他恶意攻击的。<br >
            八、损害国家机关信誉的。<br >
            九、其他违反宪法、法律、行政法规、行政规章、地方性法规的行为。<br ></p>
          <p  class="subtitle">7.保护网站安全的义务</p>
          <p  class="fs-28">禁止以任何方式对本公司进行各种破坏行为。</p>
          <p  class="subtitle">8.承担银行费用的义务</p>
          <p  class="fs-28">在申请提款至用户银行卡的银行费用由用户承担。</p>
        </div>
      </li>
      <li  class="item">
        <div  class="conent">
          <p  class="title">本公司的权利</p>
          <p  class="subtitle">1.管理用户账户的权利</p>
          <p  class="fs-28">
            如果用户提供的资料包含有第四条第3款多次恶意注册信息或第7款所列信息，本公司保留冻结其用户账户，注销其用户账户或者限制其使用全部或部门服务内容的权利。一经发现用户利用本公司制作，复制和传播的信息明显属于第三条第7款所列信息之一的
            ，本公司将立即采取屏蔽信息，发出警告，直至关闭用户账户等措施。</p>
          <p  class="subtitle">2.修改本协议条款的权利</p>
          <p  class="fs-28">
            本公司有权在必要时修改协议条款，协议条款一旦发生变动，将会在本公司相关页面上提示或公告修改内容。如果不同意所改动的内容，用户可以主动取消获得的服务。如果用户继续享用服务，则视为接受服务条款的变动。本公司保留随时修改或中断服务而不需知会用户的权利。<br
              >主要包括以下情况：<br >
            一、增加或减少游戏项目品种本公司以当期可以实现购买的品种为准，长期或临时增加或减少游戏品种均不需事先告知用户。<br >
            二、针对彩票项目截止时间的权利。本公司有权限根据彩票种类和当期销售的情况调整彩票销售截止时间，而不需事先告知用户。
          </p>
          <p  class="subtitle">3.用户向本公司提出游戏额度请求</p>
          <p  class="fs-28"> 现本公司有权从其余额提取下注游戏所需的款项金额。</p>
          <p  class="subtitle">4.兑奖，领取奖金，分配奖金的权利和义务</p>
          <p  class="fs-28">在游戏中奖情况下，由本公司根据中奖比例计算出的中奖金额，直接汇入中奖用户。</p>
          <p  class="subtitle">5.制止公款游戏的权利</p>
          <p  class="fs-28">
            本公司有权利拒绝非个人资金通过本公司游戏彩票，视讯，体育，电子，棋牌等项目，一旦发现有款项自非个人账户资金转入用户预付账户，本公司有权采取强行将款项退回原账户，终止协议等措施。本公司并将向有关管理机关报告。
          </p>
          <p  class="subtitle">6.制止未满18周岁的未成年游戏的权利</p>
          <p  class="fs-28">
            如未成年人提供虚假用户资料冒称成年人的，其在游戏项目进行的一切游戏行为将自始无效，由此给本公司及其本人造成的损失以及不能领奖的后果均由未成年人及其法定代理人承担。</p>
        </div>
      </li>
      <li  class="item">
        <div  class="conent">
          <p  class="title">本公司的义务</p>
          <p  class="subtitle">1.用户账户资料保护义务</p>
          <p  class="fs-28">
            本公司对用户账户资料提供最大限度的安全保护。当本公司用户涉嫌盗用他人第三方支付渠道（如：银联，微信，支付宝等）账户资金，或涉险其第三方支付渠道被盗用的，应涉嫌被盗用人或第三方支付公司要求的，在其承诺仅将用户资料用户涉嫌盗用事件并予以保密的前提下，本公司将向请求方提供涉嫌盗用人的用户资料。本公司用户同意放弃在此情况下向本公司追究任何责任的权利。
          </p>
          <p  class="subtitle">2.公布游戏中奖情况的义务</p>
          <p  class="fs-28">以平台方可通过视频或官方彩票数据获得最终中奖结果后，本公司将严格按照平台方机构发布的信息作为中奖情况为准。</p>
          <p  class="subtitle">3.转帐义务</p>
          <p  class="fs-28">
            在达到一定投注量情况下，用户在任何时间都可对自己的余额申请提款，本公司在核对用户资金来源正常的情况下，在收到提款请求3个工作日内将用户需提取的款项转账到用户注册的银行账户上。</p>
        </div>
      </li>
      <li  class="item">
        <div  class="conent">
          <p  class="title marginBottom15">协议成立，变更和终止</p>
          <p  class="fs-28">
            1.因网络故障，超过指定彩票时间，金额不足等原因，未能完成下注彩票的，本公司将返还用户预付资金。<br >
            2.本公司有权对本协议条款进行变更而无需事先通知用户。<br >
            3.任何一方未能履行本协议规定的任何义务，且在收到另一方发出更正通知15日内未能改正错误的，均被视为自动放弃本协议，协议同时终止。<br >
            4.一经发现公款游戏项目嫌疑，未成年人游戏嫌疑等本协议禁止的情况，本公司有权立即终止协议。</p>
        </div>
      </li>
      <li  class="item">
        <div  class="conent">
          <p  class="title">免责条款</p>
          <p  class="subtitle welcome">发生下列情况时，本公司不予承担任何法律责任：</p>
          <p  class="subtitle">1.用户资料泄露</p>
          <p  class="fs-28">
            由于用户将密码告知他人或与他人共享注册账户，或由于用户的疏忽，由此导致的任何个人资料泄露，以及由此产生的纠纷，无论何种原因导致的用户资料未授权使用，修改，用户密码，个人账户或注册信息被未授权篡改，盗用而产生的一切后果。
          </p>
          <p  class="subtitle">2.不可抗力及不可预见的情势发生</p>
          <p  class="fs-28">
            不可抗力和不可预见情势包括：自然灾害，政府行为，罢工，战争等；黑客攻击，计算机病毒侵入或发作，政府管制，彩票发行和销售机构的原因，彩票出票机或服务的故障，网络故障，国家政策变化，法律法规之变化等。因不可抗力和不可预见情势造成；暂时性关闭，用户资料或购彩失败，各个游戏平台未能收到指令等，以及由此产生的纠纷。因不可抗力和不可预见的情势造成本协议不能履行的。
          </p>
          <p  class="subtitle">3.用户原因或第三方原因造成损失</p>
          <p  class="fs-28">由于用户自身原因，或违反法律法规，以及第三方的原因，造成用户无法使用游戏项目服务或产生其他损失的。</p>
          <p  class="subtitle">4.用户游戏而产生的损失</p>
          <p  class="fs-28"> 用户根据本协议进行游戏项目而发生的直接，间接，偶然，特殊及继起的损害。</p>
          <p  class="subtitle">5.用户使用链接或下载资料产生的损害</p>
          <p  class="fs-28">由于使用与本公司链接的其他网站，或者使用通过本公司下载或取得的资料，造成用户资料泄露，用户电脑系统损害等情况及由此而导致的任何争议和后果。
          </p>
        </div>
      </li>
      <li  class="item">
        <div  class="conent">
          <p  class="title marginBottom15">合同组成</p>
          <p  class="fs-28">
            本公司主页以及其他页面有关（包括但不限于）会员注册流程，变更流程，游戏流程，会员支付与结算，相关奖励，会员服务等运营内部的细则以及法律声明均为本协议的有效组成部分，是对本协议的解释扩充，与本协议有着相同的法律效力。
            用户资料隐私保护，网站禁止行为，网站知识产权保护等约定详见《法律声明》。</p>
        </div>
      </li>
      <li  class="item">
        <div  class="conent">
          <p  class="title">注意事项</p>
          <p  class="subtitle welcome">1.禁止未满18周岁（未成年人）在本站注册，同时不提倡学生购买游戏，其中也包括在线大学生。</p>
          <p  class="subtitle welcome">2.为确保您的游戏申请能及时成功提交，请您务必在游戏开放期间内申请钱有足够的款项在您的账号。</p>
          <p  class="subtitle welcome">3.在使用网络支付平台时请注意：无论何种网络支付系统时都将收取一定的手续费。</p>
          <p  class="subtitle welcome">4.请确认你的电子邮箱地址为长期使用之有效邮箱。并随时留意查收本站的邮件。</p>
        </div>
      </li>
    </ul> """),
    HelpCenterBean(title: "关于我们", text: """<div class="g-content">
        <div class="conent">
          <p class="title">
            关于我们
          </p>
          <p>
            <span style="color:#E53333;">我们公司</span>宗旨– 提供顾客最佳水位和最优服务。
          </p>
          <p>

          </p>
          <p>
            自成立以来，<span>我们公司</span>始终坚持一个目标：在竞争中不断超越自我，立志成为业内一流的博彩网站之一。
            在此激励下，我们致力于向我们的合作伙伴提供一个公平合理、安全可靠和准确快捷的平台，并为活跃用户提供24×7的支援。
          </p>
          <p>
            <br>
          </p>
          <p>
            我们的使命不仅仅是为您提供一流的线上娱乐，同时协助您设置每场游戏的限额，让您在良好的娱乐心态下获得最佳的娱乐体验。
          </p>
          <p>
            <br>
          </p>
          <p class="title">
            诚信专业
          </p>
          <p>
            作为国际专业的网上博彩游戏客户端运营企业，我们凭藉集合世界级的博彩资讯专家、丰富经验的服务团队、市场营销专家、先进的软硬件开发人员建立出&nbsp;<span>我们公司</span>&nbsp;全面而完善的组织体系。我们承诺，为每一位客户提供最新、最安全、最准确的专业博彩数据，以及全方位的国际化服务。
          </p>
          <p>
            <br>
          </p>
          <p class="title">
            严格维护保密及安全性
          </p>
          <p>
            根据规定，每位<span>我们公司</span>用户只能拥有一个相对应的帐户。为维护系统的完整性及公平原则，我们将会进行不定期的安全检查。客户的安全和游戏的公正性乃<span>我们公司</span>&nbsp;最重要的服务信念与宗旨。本公司更用上最先进的加密措施来保证游戏的安全，并作24小时的后台检测和监控，所有数据的内部出入都受到限制及严密的监控，并保证决不将您的资料出售或透露给第三方，确保我们的客户可以在一个最保密、最安全的网络游戏空间尽情玩乐。
          </p>
          <p>
            <br>
          </p>
          <p class="title">
            公平游戏
          </p>
          <p>
            <span>我们公司</span>&nbsp;致力为玩家提供最公正的环境，由现时亚洲市场最具权威及最先进的科技系统所提供。体育博彩拥有顶级的盘房操盘，投入大量的人力以及资源，提高完整赛事
            此外，真人视讯所有参与现场游戏的荷官均经过严格训练及挑选，每局牌局均有主管负责监察，以确保游戏的真实度。
          </p>
          <p>
            <br>
          </p>
          <p>
            我们提供广泛且高娱乐性的投注产品及机会，包括：彩票游戏，真人娱乐，体育博彩，老虎机。我们致力于为我们尊贵的客户提供符合其投注习惯，便捷且安全的网络投注平台。
          </p>
          <p>
            <br>
          </p>
          <p>
            您的博彩体验也将在我们的彩票游戏中延续。您将在我们这里同样也找到种类繁多的快乐彩游戏。游戏下注玩法众多。我们也为您同时提供真钱模式及试玩模式。希望您可以通过练习赢得更多彩金。
          </p>
          <p>
            <br>
          </p>
          <p class="title">
            优质服务
          </p>
          <p>
            我们很自豪地为我们尊贵的客户提供无需下载的真人娱乐城体验，包括：百家乐、二十一点、龙虎、轮盘、骰宝等众多精彩游戏。我们为客户提供多种限额选择的娱乐城入座桌台及高返水额度。客户也可选择无抽水百家乐及其众多的娱乐城产品。到目前为止，娱乐城游戏仍是亚洲博彩客户的最喜爱。点击这里，开启您精彩刺激的真人娱乐城之旅。
          </p>
          <p>
            <br>
          </p>
          <p>
            除了真人娱乐城以外，您也可以投注于老虎机及娱乐城游戏。我们为您提供种类繁多的网页版和手机移动版本老虎机及娱乐城游戏。您将在这里找到最新最齐全的娱乐城游戏，比如：老虎机、二十一点、德州扑克等等。作为我们的客户，您不仅可以赢得高额的累积奖池，也可以同时参与老虎机竞标赛，赢取更加高额的巨奖。
          </p>
          <p>
            <br>
          </p>
          <p class="title">
            我们的承诺
          </p>
          <p>
            <span>我们公司</span>致力打造亚洲最具品牌影响力的娱乐公司，我们重金聘请专业的技术服务团队，我们简单明了的宗旨就是提供给广大客户最优质的博彩娱乐以及意想不到的收获，我们坚决奉行客户至上的原则，而不断推陈出新的优惠让您实实在在的感受到我们公司的用心。
          </p>
          <p>
            您的信息保密性对我们来说是最重要的而且我们将坚持实行严格保密和隐私制度。
          </p>
          <p>
            <span>我们公司</span>提供128位SSL加密传输与MD5加密密码，在最大程度上保障用户信息的安全。
          </p>
          <p>
            <br>
          </p>
          <p>
            我们提供7×24小时专业的客户服务，以服务会员不打烊的精神，随时解决客户的咨询及问题，让每位玩家有宾至如归的感觉。
          </p>
          <p>
            <br>
          </p>
        </div>
      </div>"""),
    HelpCenterBean(title: "联络我们", text: """<div class="g-content">
        <div  class="content">
          <p class="title">
            联络我们
          </p>
          <p>
            <span >我们公司的客服中心全年无休，提供1周7天、每天24小时的优质服务。</span>
          </p>
          <p>
            <span >如果您对本网站的使用有任何疑问，可以透过下列任意方式与客服人员联系，享受最实时最专业的服务！</span>
          </p>
          <p>
            <br>
          </p>
          <p>
            <span >1.点击“<a
                href="https://cf48c203c5a3e.chatnow.mstatik.com/widget/standalone.html?eid=220893"
                target="_blank">在线客服</a>”链接，即可进入在线客服系统与客服人员联系。</span>
          </p>
          <p>
            <span >2.您亦可使用Email，QQ，微信等聊天软件与客服人员取得联系</span>
          </p>
          <p>
            <span >Email:&nbsp;</span>
          </p>
          <p>
            <span >客服QQ:&nbsp;<span
                style="color:#333333;font-family:&quot;background-color:#F1F3F5;">3200562</span></span>
          </p>
          <p>
            <span >投诉QQ:&nbsp;<span
                style="color:#333333;font-family:&quot;background-color:#F1F3F5;">970073888</span></span>
          </p>
          <p>
            <span >投诉微信：</span>
          </p>
        </div>
      </div> """),
    HelpCenterBean(title: "充值帮助", text: """<div class="g-content">
        <div class="content">
          <p class="title">
            充值帮助
          </p>
          <p>
            <span>我们公司 </span>提供以下两种方式提供您选择进行存款：
          </p>
          <p>
            <br>
          </p>
          <p class="title">
            1、银行卡存款
          </p>
          <p>
            银行卡存款是通过本公司指定的银行卡号进行存款支付，银行卡存款可以用网银转账，ATM机存款，或者柜台汇款的方式支付，具体步骤如下：
          </p>
          <p>
            请您登陆会员账号，点击：“存款”，选择“银行卡存款”，进入查看最新的收款银行账户信息或向24小时在线客服人员索取。
          </p>
          <p>
            <br>
          </p>
          <p>
            目前<span>我们公司</span>提供银行，支付宝，微信支付三种方式可选择，跨行转账请您是要跨行快汇或加急，存款到账时间约三到五分钟。转账成功后请您在“银行卡存款”上提交您存入的金额，财务确认收款后会立即为您添加到游戏账户。会员通过银行卡存款100元以上系统将自动增加存款优惠，存入会员的游戏账号上。
          </p>
          <p>
            <br>
          </p>
          <p class="title">
            2、在线存款
          </p>
          <p>
            会员登录后点击“存款”选择“在线存款”。
          </p>
          <p>
            输入存款额度，选择支付银行，输入验证码，确认送出后并耐心等待载入网络银行页面，传输中已经将您的账户数据加密，请放心进入网络银行页面，确实填写您银行账号信息，支付成功后额度将在5分钟内系统处理完成，立即加入到您的会员账户。
          </p>
          <p>
            <br>
          </p>
          <p class="title">
            存款需知
          </p>
          <p>
            <span>我们公司</span>单笔最低存款￥<span class="blue">100</span>元人民币，线上支付单笔最高存款上限为￥<span
            class="blue">50000</span>人民币，若存款超过单笔限额，请您分多笔存入。未开通网银的会员，请亲洽您的银行柜台办理。如有任何问题，请您联系
          </p>
          <p>
            <br>
          </p>
          <p class="title">
            24小时线上客服
          </p>
          <p>
            QQ：<span class="blue">3200562&nbsp; 970073888</span>
          </p>
          <p>
            微信：<span class="blue">xxxxx</span>
          </p>
        </div>
      </div>"""),
    HelpCenterBean(title: "提现帮助", text: """ <div class="g-content">
        <div data-v-40a3d258="" class="content">
          <p class="title">
            提现帮助
          </p>
          <p class="subtitle">
            1、提现方法
          </p>
          <p>
            会员登陆会员后点击“取款”， 查看是否有扣除手续费<span style="color:#E53333;"><span
                style="color:#E53333;"></span></span>，点击继续出款，输入取款密码，输入取款额度，确认提款人姓名与您银行账号是否与持有人相符。如有任何问题，请您联系<span><span>我们公司</span></span>在线客服咨询，我们将在第一时间为您解答问题。
          </p>
          <p>
            <br>
          </p>
          <p class="subtitle">
            2、提现需知
          </p>
  
          <p>
            <span>我们公司</span>最低取款为￥<span style="color:#FF0000;">100</span> 元，单笔最高取款上限为￥<span
              style="color:#FF0000;">200000</span> 元，在达到有效投注的情况下，线上取款24小时免费取款5次，5次以上每笔收取50元的手续费。
          </p>
          <p class="subtitle">
            3、有效投注
          </p>
  
          <p>
            每次存款都记录一个有效投注存入稽核点，会员需要在存入之后，达到每一次要求的有效投注。当未达到有效投注常态性稽核，将扣除存款的50%+50元手续费。最后一次有效投注按照常态性稽核点稽核，请每次存款后，是否都有达到有效投注常态性稽核。
          </p>
          <p>
            <br>
          </p>
          <p>
            请注意：各游戏和局/未接受/取消注单，不纳入有效投注计算，运动博弈游戏项目，大赔率玩法计算有效投注金额，小赔率玩法计算输赢金额为有效投注。我们公司大赔率产品包括：标准盘、过关、波胆、总入球、半全场、双胜彩、冠军赛等。
          </p>
          <p>
            <br>
          </p>
          <p>
            如有任何问题，请洽谈24小时在线客服
          </p>
        </div>
      </div>"""),
    HelpCenterBean(title: "常见问题", text: """<div class="g-content">
        <div class="content">
        <p class="MsoNormal">
          <b>1.【网站】实力怎样？</b>
        </p>
        <p class="MsoNormal">
          您好，请参阅主页“关于我们”。
        </p>
        <p class="MsoNormal">
          <b>2.在贵公司进行游戏是否安全？</b>
        </p>
        <p class="MsoNormal">
          您好，本公司系统绝对安全。我们决不泄漏客户的个人资料给任何商业机构。此外，我们亦要求有交易往来的银行，信用卡中转代理等严格保密客户的资料。所有的存款将视为贸易户口，并不会交给其它的人士进行。
        </p>
        <p class="MsoNormal">
          <b>3.网上博彩是否合法？</b>
        </p>
        <p class="MsoNormal">
          您好，有的国家或地区当地法律禁止博彩，在这种情况下，请您务必遵守当地法律，如有任何疑问，请寻求当地法律部门的意见。本公司不能亦不会接受任何人士违犯当地法律所引致之任何责任。
        </p>
        <p class="MsoNormal">
          <b>4.在【网站】城进行投注是否有年龄限制？</b>
        </p>
        <p class="MsoNormal">
          您好，是的，投注合法年龄必须年满18周岁。
        </p>
        <p class="MsoNormal">
          <b>5.开户是否要填写真实姓名？</b>
        </p>
        <p class="MsoNormal">
          您好，基于安全理由，提款时财务部会按照注册姓名进行审核，银行卡户名必须与注册姓名相同方可提款，所以请您在开户时填写的姓名必须与您提款的户名相同。
        </p>
        <p class="MsoNormal">
          <b>6.忘记密码怎么办？</b>
        </p>
        <p class="MsoNormal">
          您可点击首页忘记密码功能，填写您的会员帐号与取款密码，即可取回您当初设定的密码。当您无法收取邮件时，您也可以联系24小时在线客服人员咨询协助您取回您的账号密码。
        </p>
        <p class="MsoNormal">
          <b>7.【网站】城有哪些游戏？</b>
        </p>
        <p class="MsoNormal">
          您好，【网站】目前为您提供“运动博弈”最全的“真人娱乐”游戏和“电子游艺”“彩票游戏”。
        </p>
        <p class="MsoNormal">
          <b>8.我该如何为我的游戏账号充值？</b>
        </p>
        <p class="MsoNormal">
          您好，公司目前提供两种方式入款，1.在线存款&nbsp;2.银行划款，请您点击线上存款选择其中一种方式入款，谢谢！（注：选择公司入款的客户，请您在每次入款前务必与我们联络确认汇款账号，如将款项存入已过期账号，导致公司无法查收，恕不负责，请您留意，谢谢！）
        </p>
        <p class="MsoNormal">
          <b>9.为什么在线支付成功后额度没有立即返到我的游戏帐号呢？</b>
        </p>
        <p class="MsoNormal">
          您好，这是因为在线支付系统需要经过密锁切换及内部验证程序，而这也是我们的保安程序之一，所以请您不必担心，款项一定不会丢失。如果您在在线支付超过30分钟后仍然还未收到您的款项，请与我们客服联系处理。
        </p>
        <p class="MsoNormal">
          <b>10.如何证明游戏结果是实时的？</b>
        </p>
        <p class="MsoNormal">
          您好，您可以通过游戏的视频影像进行监查，视频内的画面均为各平台现场娱乐城所播放的画面是同步的。我们确保所有游戏结果均为真实的实时结果。
        </p>
        <p>
          <br>
        </p>
        <p>
          <br>
        </p>
        <p>
          <br>
        </p>
      </div>
      </div>"""),
    HelpCenterBean(title: "博彩规则", text: """<div class="g-content">
        <div  class="content">
          <p class="title">博彩规则</p>
          <p>
            我们公司使用服务条款和细则
          </p>
          <h3>
            <span style="color:#00C8E2;font-size:16px;">1. 一般</span>
          </h3>
          <p>
            1.1.
          </p>
          <p>
            此条款和规则适用于您使用网络，手机或其他平台，通过<span><span style="color:#000000;">本公司</span></span>和其他相关网址进行的各项游戏（见下文的定义)。
          </p>
          <p>
            1.2.
          </p>
          <p>
            用户通过电视、电脑、移动设备及任何其他通信媒介使用或访问<span><span
                style="color:#000000;">本公司</span></span>拥有的任何其他网站或下载的应用程序，则将被视为接受和理解全部条款：(i)账户注册流程；(ii)游戏规则；(iii)隐私政策；(iv)规则与条款。
          </p>
          <p>
            1.3.
          </p>
          <p>
            在用户点击“接受”按钮前，请仔细阅读规则与条款，如果您不接受该规则与条款，请勿使用本公司网站。
          </p>
          <p>
            1.4.
          </p>
          <p>
            一旦您成功注册，并点击“接受”。将被视为接受和理解全部规则与条款。
          </p>
          <p>
            1.5.
          </p>
          <p>
            本公司保留编辑、补充和修改规则与条款的权利。<span><span
                style="color:#000000;">本公司</span></span>将尽一切合理方式，确保客户收取到规定与条款变更通知。如果您不接受任何规则与条款变更，您应停止使用本公司网站及服务，且关闭其账户。若在变更后继续使用本公司网站，将被视为您已接受规则与条款更改。
          </p>
          <p>
            1.6.
          </p>
          <p>
            <span><span style="color:#000000;">本公司</span></span>所提供的产品和服务，执照由菲律宾娱乐及博彩公司<span
              style="color:#FF0000;">Philippine Amusement and Gaming Corporation（PAGCOR）</span>核发许可及监管。
          </p>
          <p>
            1.7.
          </p>
          <p>
            该规则与条款拥有法律约束力及构成用户和<span><span style="color:#000000;">本公司</span></span><span
              style="color:#000000;">之</span>间的协议。
          </p>
          <p>
            1.8.
          </p>
          <p>
            该规则与条款及游戏中规则与条款二者之间任何不一致，均以后者为准。不覆盖游戏中任何方面的特定规则与条款。但这些规则与条款的提供，则须适用于该项目公司与用户的关系。
          </p>
          <p>
            1.9
          </p>
          <p>
            用户完全理解并同意遵守这些规则与条款可不定时修改时间。
          </p>
          <p>
            1.10.
          </p>
          <p>
            修订规则与条款将即时生效且公布于网站。用户均可即时了解及查看规则条款和游戏规则中的特别条款。且根据网页上所更改日期识别相应的规则条款更新。在不违反上述规定下，公司将会在拟定规则与条款修正前预先通知用户并提供一份变更摘要。
          </p>
          <p>
            1.11.
          </p>
          <p>
            点击网站上独立链接即可了解及查看<span><span style="color:#000000;">本公司</span></span>游戏规则，网站维护，隐私政策及其它重要资讯。该内容根据本公司规则与条款制定。
          </p>
          <p>
            1.12.
          </p>
          <p>
            在不妨碍上述第1条规定下，此项协议均可在<span><span style="color:#000000;">本公司</span></span>任何游戏上使用。<span><span
                style="color:#000000;">本公司</span></span>保留从本公司网站自行决定添加和删除游戏的权利。
          </p>
          <p>
            1.13.
          </p>
          <p>
            本公司网站提供多种语言版本的规则条款，以便捷客户之需求。若该项语言条款与英文版有任何差异，则
          </p>
          <p>
            <br>
          </p>
          <p>
            以英文版为准。
          </p>
          <h3>
            <span style="color:#00C8E2;font-size:16px;">2. 会员账户</span>
          </h3>
          <p>
            2.1.注册会员账户及资格
          </p>
          <p>
            2.1.1.
          </p>
          <p>
            参加<span><span style="color:#000000;">本公司</span></span>任何现金游戏，所有申请者必须年满十八岁以上，方可在<span><span
                style="color:#000000;">本公司</span></span>注册。
          </p>
          <p>
            2.1.2.<br>
            <span><span style="color:#000000;">本公司</span></span>不接受菲律宾，香港，美国，台湾，新加坡和以色列的居民申请开户。
          </p>
          <p>
            <span><span style="color:#000000;">本公司</span></span>定期筛查其注册为异常，并立即无限期中止以上国家的玩家账户。
          </p>
          <p>
            用户须自行负责及确认网络博彩在其所处司法管辖境内的合法性，并遵循相关法律规定。<span><span
                style="color:#000000;">本公司</span></span>网站并未企图让法律禁止区域内的任何人使用网站。
            网站的可用性并不能解释为我们提供或鼓励您在任何国家（包括法律禁止的国家）内使用娱乐场。若当地禁止网络博彩或用户违法此项条款，<span><span
                style="color:#000000;">本公司</span></span>将一概不负责。
          </p>
          <p>
            2.1.3.
          </p>
          <p>
            <span><span style="color:#000000;">本公司</span></span>有权委任支付解决供应商代表<span><span
                style="color:#000000;">本公司</span></span>接受或支付款项。
          </p>
          <p>
            2.1.4.
          </p>
          <p>
            用户在本公司网站仅可拥有一个账户。若注册多个以上账户，将会全部关闭。
          </p>
          <p>
            2.1.5.
          </p>
          <p>
            用户若拥有多个不同姓名的账户，需立即通知<span><span style="color:#000000;">本公司</span></span>。
          </p>
          <p>
            2.1.6.
          </p>
          <p>
            用户填写完详细资料信息且在<span><span style="color:#000000;">本公司</span></span>网站上提交申请注册会员，<span><span
                style="color:#000000;">本公司</span></span>保留拒绝权利。
          </p>
          <p>
            2.1.7.
          </p>
          <p>
            用户声明并承诺，用户在注册和办理会员资格申请时所提供的所有资料，包括身份信息、地址、联系方式、邮箱地址、资金来源 ( 包括有关银行账号和卡号 )，在一切方面均真实、准确、完整。<span><span
                style="color:#000000;">本公司</span></span>会对用户的账户信息进行核查，且需要求用户提供额外文件，如护照复印件，以验证其身份。若用户未能提供所要求的资料或文件，或用户提供的该信息及文件是虚假或具有误导性的，<span><span
                style="color:#000000;">本公司</span></span>有权冻结货关闭其账户。
          </p>
          <p>
            2.1.8.
          </p>
          <p>
            用户在注册当中，须选择一个用户名和密码，以便登录到网站。用户应自行负责维护其登录信息，不得向他人透露登录信息。若因用户向第3方透露其信息，以导致第3方滥用或误用，<span><span
                style="color:#000000;">本公司</span></span>概不负责。
          </p>
          <p>
            2.1.9.
          </p>
          <p>
            禁止户内转账。
          </p>
          <p>
            2.1.10.
          </p>
          <p>
            禁止出售信息/发送/获取其他账户。
          </p>
          <p>
            2.2.存款
          </p>
          <p>
            2.2.1.
          </p>
          <p>
            用户账户内需有足够资金方可进行投注。<span><span style="color:#000000;">本公司</span></span>不支持信用网。
          </p>
          <p>
            2.2.2.
          </p>
          <p>
            请用户登录网站后，点击“我的账户”及“存款”页面即可查询到相应的存款方式。
          </p>
          <p>
            2.2.3.
          </p>
          <p>
            手续费根据用户所相对应的存款方式、银行不同而金额不一。请您登录后点击“我的账户”及“存款”页面即可查询到手续费说明。
          </p>
          <p>
            2.2.4.
          </p>
          <p>
            若用户使用信用卡或借记卡存款，<span><span style="color:#000000;">本公司</span></span>须在收到到该笔金额后，方可处理到会员账户。
          </p>
          <p>
            2.2.5.
          </p>
          <p>
            <span><span style="color:#000000;">本公司</span></span>保留使用附加程序验证用户身份的权利。
          </p>
          <p>
            2.2.6.
          </p>
          <p>
            对于任何信贷，<span><span style="color:#000000;">本公司</span></span>不提供任何服务。
          </p>
          <p>
            2.2.7.
          </p>
          <p>
            会员帐户中余额不承担利息。
          </p>
          <p>
            2.3.账户管理
          </p>
          <p>
            2.3.1
          </p>
          <p>
            <span><span
                style="color:#000000;">本公司</span></span>负责管理用户的会员帐号，其中包括：计算已下注或提供金额（用户随时承担潜在风险），不定时计算用户可投注余额，同时计算在游戏中所结算完的投注额。
          </p>
          <p>
            2.3.2
          </p>
          <p>
            投注限额根据会员账户中的投注金额比来决定。
          </p>
          <p>
            2.3.3
          </p>
          <p>
            <span><span style="color:#000000;">本公司</span></span>根据用户账户中的保留金额、可投注额及欠款数额进行调查。在没有任何明显错误的情况下，不会受到任何调查。
          </p>
          <p>
            2.3.4
          </p>
          <p>
            当用户在<span><span style="color:#000000;">本公司</span></span>进行投注后，该投注金额需耐性等待游戏结果并派彩。对此，一旦投注成功，将无法取消。
          </p>
          <p>
            2.4.派彩
          </p>
          <p>
            2.4.1.
          </p>
          <p>
            当用户所投注的游戏已明确结果，或<span><span style="color:#000000;">本公司</span></span><span
              style="color:#000000;">已</span>确认游戏结果并结算时，该金额将会根据客户投注的金额进行派彩。
          </p>
          <p>
            2.4.2.
          </p>
          <p>
            若<span><span style="color:#000000;">本公司</span></span>因技术或人为或其他方式导致派彩错误，<span><span
                style="color:#000000;">本公司</span></span>有权在错误发生时或之后，取消涉及此类的资金任何交易、或将相应数额从会员账户扣除。若用户发现此项金额已派送其账户，有义务立即邮件通知<span><span
                style="color:#000000;">本公司</span></span>。
          </p>
          <p>
            <br>
          </p>
          <p>
            2.5.提款
          </p>
          <p>
            2.5.1.
          </p>
          <p>
            用户可提取任何金额，但该金额需完成流水倍数。
          </p>
          <p>
            <br>
          </p>
          <p>
            2.5.2.
          </p>
          <p>
            提款需登录<span><span style="color:#000000;">本公司</span></span><span
              style="color:#000000;">网</span>站自行操作。我们不接受以电话或电邮方式提款。
          </p>
          <p>
            <br>
          </p>
          <p>
            2.5.3.
          </p>
          <p>
            <span><span
                style="color:#000000;">本公司</span></span>提供多种提款方式。用户需使用已存款的银行账户进行提款操作。提款所收取的手续费根据用户的选择方式有所不同。详情您即可在登录后，点击“我的账户”，”提款“进行查看。
          </p>
          <p>
            <br>
          </p>
          <p>
            2.5.4.
          </p>
          <p>
            <span><span style="color:#000000;">本公司</span></span>只接受用户在提款时使用与存款相同的账户。
          </p>
          <p>
            <br>
          </p>
          <p>
            2.5.5.
          </p>
          <p>
            <span><span style="color:#000000;">本公司</span></span>有权在用户提交提款申请时，要求用户提供有效期内的身份证明文件。
          </p>
          <p>
            2.5.6.
          </p>
          <p>
            在处理提款申请前，相关部门需审查用户游戏方式是否有违规或异常。在维护<span><span
                style="color:#000000;">本公司</span></span>公平公正游戏，零赌注、低利润投注或对冲投注均视为违规。若<span><span
                style="color:#000000;">本公司</span></span>认定为违规的情况下，<span><span
                style="color:#000000;">本公司</span></span>有权扣留任何提款或冻结该红利。用户若在特定优惠中领取免费奖金，未按规则进行存款而赢利的情况下，对此，<span><span
                style="color:#000000;">本公司</span></span>保留用户在提款之前，需存款相应的赢利奖金且完成相应倍数的权利。
          </p>
          <p>
            2.5.7.
          </p>
          <p>
            若用户还没有达到存款以及红利流水倍数将无法申请提款。<span><span
                style="color:#000000;">本公司</span></span>对此保留权力拒绝提供任何红利给予任何用户以限制用户滥用红利。
          </p>
          <p>
            2.5.8.
          </p>
          <p>
            用户提款所使用的银行卡须于注册所填写的姓名一致。
          </p>
          <p>
            2.5.9.
          </p>
          <p>
            用户需使用已存款过的信用卡/借记卡进行提款操作。若用户有多张信用卡/借记卡，则近6个月存款最多次数的信用卡/借记卡进行提款。（如万事达卡，则无法接受提款）。
          </p>
          <p>
            2.5.10.
          </p>
          <p>
            信用卡/借记卡交易通常需要3至5个工作日。
          </p>
          <p>
            2.5.11.
          </p>
          <p>
            <span><span style="color:#000000;">本公司</span></span>为保障用户账户安全，用户所使用信用卡/借记卡信息绝不会储存，且在传输过程中均已加密。
          </p>
          <p>
            2.5.12.
          </p>
          <p>
            <span><span style="color:#000000;">本公司</span></span>保留修改信用卡/借记卡限额，及拒绝处理任何提款/存款的权利。
          </p>
          <p>
            2.6关闭会员账户
          </p>
          <p>
            2.6.1
          </p>
          <p>
            用户可随时关闭其账户，若账户中仍有金额，您可以进行提款操作，对此，<span><span
                style="color:#000000;">本公司</span></span>须扣除相应的手续费；若账户中仍有注单，您需耐心等待注单派彩结束后方可关闭。
          </p>
          <p>
            2.6.2
          </p>
          <p>
            退还方式由<span><span style="color:#000000;">本公司</span></span>自行决定。
          </p>
          <p>
            2.6.3
          </p>
          <p>
            <span><span style="color:#000000;">本公司</span></span>有权自行判断是否关闭用户会员账户，无须说明理由或事先通知。且退还账户余额时，须扣除相关提款手续费。
          </p>
          <p>
            2.6.4
          </p>
          <p>
            用户领取优惠奖金起的1个月内尚未使用其金额，<span><span style="color:#000000;">本公司</span></span>有权取消该优惠奖金。
          </p>
          <p>
            2.6.5
          </p>
          <p>
            用户以<span><span style="color:#000000;">本公司</span></span>所提供的奖金作为投注娱乐的资金。该游戏并非符合奖金规定，<span><span
                style="color:#000000;">本公司</span></span>有权拒绝提款申请，扣除奖金及赢取金额，且不另行通知。如有该情形发生，<span><span
                style="color:#000000;">本公司</span></span><span style="color:#000000;">冻</span>结其涉嫌的会员账户。
          </p>
          <h3>
            <span style="color:#00C8E2;font-size:16px;">3.用户的义务</span>
          </h3>
          <p>
            3.1.用户在此声明并保证：
          </p>
          <p>
            3.1.1.
          </p>
          <p>
            用户需最低年满十八(18)周岁，且参考您所在地的司法管辖境内的法令，是否可以参与本网站的各项游戏；
          </p>
          <p>
            <br>
          </p>
          <p>
            3.1.2.
          </p>
          <p>
            用户需在此确认，在<span><span style="color:#000000;">本公司</span></span>所注册的会员账户仅因个人需求、消遣娱乐之用。而绝非财务操作等其他目的之用；
          </p>
          <p>
            <br>
          </p>
          <p>
            3.1.3.
          </p>
          <p>
            用户仅可代表自己本人使用该账户进行投注娱乐；
          </p>
          <p>
            <br>
          </p>
          <p>
            3.1.4.
          </p>
          <p>
            用户需确认本人不是菲律宾，美国，香港，台湾，新加坡及以色列的居民。
          </p>
          <p>
            <br>
          </p>
          <p>
            3.1.5.
          </p>
          <p>
            用户需确认，注册所填写的一切资料均为真实，完整和正确的，若资料有任何变更，用户应即时通知<span><span style="color:#000000;">本公司</span></span>。
          </p>
          <p>
            <br>
          </p>
          <p>
            3.1.6.
          </p>
          <p>
            用户在<span><span style="color:#000000;">本公司</span></span><span
              style="color:#000000;">所</span>赢取奖金，根据当地相关法律应自行负责申报和游戏税，向监管机构的缴纳博彩税；
          </p>
          <p>
            <br>
          </p>
          <p>
            3.1.7.
          </p>
          <p>
            用户需确认其本人存入会员账户的一切资金不涉及任何违法事情，非法活动或其他不法来源；
          </p>
          <p>
            <br>
          </p>
          <p>
            3.1.8.
          </p>
          <p>
            用户需理解，参与各项游戏即自行承担会员账户的资金风险。
          </p>
          <p>
            <br>
          </p>
          <p>
            3.1.9.
          </p>
          <p>
            用户不得参与任何欺诈、串通、作弊或其他非法活动，以影响个人或他人游戏；亦不得在任何一游戏中使用任何辅助软件、技术、硬件设备。若发现前述情况，<span><span
                style="color:#000000;">本公司</span></span>有权冻结或关闭会员账户。
          </p>
          <p>
            <br>
          </p>
          <p>
            3.1.10.
          </p>
          <p>
            用户进行存款和提款操作时，须使用其本人有效且合法个人信用卡与其他金融工具；
          </p>
          <p>
            <br>
          </p>
          <p>
            3.1.11.
          </p>
          <p>
            <span><span style="color:#000000;">本公司</span></span>向用户所提供下载软件，皆属于<span><span
                style="color:#000000;">本公司</span></span>、<span><span
                style="color:#000000;">本公司</span></span>合作伙伴和第三方软件提供公司所有，且受版权法和其他适用的知识产权法律的保护。用户需以个人娱乐目的而使用该软件，并应遵守规则与条款，特别条款及相关法律规范；
          </p>
          <p>
            <br>
          </p>
          <p>
            3.1.12.
          </p>
          <p>
            各项游戏规则说明均可点击网站游戏设置中进行查看。用户在聊天室内应礼貌对待其他用户，避免粗俗或淫秽的字眼。
          </p>
          <p>
            <br>
          </p>
          <p>
            3.1.13
          </p>
          <p>
            若发生以下的情况，<span><span style="color:#000000;">本公司</span></span>保留拒绝提款以及作废所有赢利与奖金的权利：
          </p>
          <p>
            娱乐场发生停机错误或技术问题。<span><span style="color:#000000;">本公司</span></span>无法保证该服务没有受到影响，但我们会采取合理之措施后尽速予以回复。
          </p>
          <p>
            随机号码游戏（random number generator）发生任何错误或故障。
          </p>
          <p>
            使用任何不正当手段（任何设备，自动设备，软件，程序等方式）或游戏供应商所引发的操作问题导致游戏不正常运作。
          </p>
          <p>
            <br>
          </p>
          <p>
            <br>
          </p>
          <h3>
            <span style="color:#00C8E2;font-size:16px;">5. 特定条款</span>
          </h3>
          <p>
            5.1.
          </p>
          <p>
            请点击网页内的独立链接了解对特定的游戏规则、规则及条款说明。该项规定亦属于本规则与条款的一部分，用户点击“同意”按钮后即视为接受该网页内所涉及的特定条款。
          </p>
          <p>
            <br>
          </p>
          <h3>
            <span style="color:#00C8E2;font-size:16px;">6. 私隐政策</span>
          </h3>
          <p>
            6.1.
          </p>
          <p>
            本公司网站为用户提供使用网站、参与各项游戏、且提供游戏配套服务。用户需在此确认并同意隐私政策：<span><span
                style="color:#000000;">本公司</span></span>将有权处理任何提供给我们的或我们所持有的关于您的个人信息。
          </p>
          <p>
            <br>
          </p>
          <p>
            6.2.
          </p>
          <p>
            <span><span style="color:#000000;">本公司</span></span>遵循商业惯例与相关法律，保护用户个人资料并尊重其私隐。
          </p>
          <p>
            <br>
          </p>
          <p>
            6.3.
          </p>
          <p>
            <span><span style="color:#000000;">本公司</span></span>允许用户使用其个人信息来参与各项游戏及开展相关的游戏业务。
          </p>
          <p>
            <br>
          </p>
          <p>
            6.4.
          </p>
          <p>
            <span><span style="color:#000000;">本公司</span></span>有权使用用户个人资料数据进行验证核实用户参与游戏的目的。
          </p>
          <p>
            <br>
          </p>
          <p>
            6.5.
          </p>
          <p>
            本公司将不会把用户的个人资料透露给第三方。除非用户提出要求：如会员交易或参与游戏中所需要的身份验证流程或法律程序。因<span><span
                style="color:#000000;">本公司</span></span>的业务伙伴、供应商或服务供应商将参与本网站部分业务的营运，<span><span
                style="color:#000000;">本公司</span></span>可能会向其提供用户的个人数据。用户在此同意上述各项行为。
          </p>
          <p>
            <br>
          </p>
          <p>
            6.6.
          </p>
          <p>
            用户有权访问其在<span><span style="color:#000000;">本公司</span></span>注册的个人信息。
          </p>
          <p>
            <br>
          </p>
          <p>
            6.7.
          </p>
          <p>
            用户若更改账户任何信息应立即通知本公司。
          </p>
          <p>
            <br>
          </p>
          <p>
            6.8.
          </p>
          <p>
            为了提供高效的服务，用户需在此同意<span><span style="color:#000000;">本公司</span></span>或服务供应商将可能会把其个人资料转移到其他国家。
          </p>
          <p>
            <br>
          </p>
          <p>
            6.9.
          </p>
          <p>
            在处理用户会员帐户和相关交易时，<span><span
                style="color:#000000;">本公司</span></span>可求助于信用评级机构、欺诈检测机构的反洗钱机构，可能相关机构会保留用户信息记录。对此，用户在此同意上述行为。
          </p>
          <p>
            <br>
          </p>
          <p>
            6.10.
          </p>
          <p>
            为确保用户使用本网站更加快捷及提升优质人性化服务，<span><span style="color:#000000;">本公司</span></span><span
              style="color:#000000;">将会</span>收集用户浏览器的cookie所传送的信息。用户可在其浏览器上关闭cookies，但可能导致您无法使用网站的某些区域或特色功能。（请参照浏览器说明操作）。
          </p>
          <p>
            <br>
          </p>
          <p>
            6.11.
          </p>
          <p>
            用户同意<span><span
                style="color:#000000;">本公司</span></span>随时通知有关网站的变更、新服务推出和优惠活动。如果用户不愿意收到该类信息，可以选择退出服务名单。用户也可再次发邮件通知本公司相关部门，选择再次加入该服务名单中。
          </p>
          <p>
            <br>
          </p>
          <h3>
            <span style="color:#00C8E2;font-size:16px;">7. 联系我们</span>
          </h3>
          <p>
            7.1.
          </p>
          <p>
            若用户对业务有任何疑问，请提供详细信息，您即时联系<span><span
                style="color:#000000;">本公司</span></span>客服人员或发送邮件至我方<span>进行细节查询</span>“联络我们”版块获得邮件地址。<span><span
                style="color:#000000;">本公司</span></span><span style="color:#000000;">的</span>工作人员将会审查，<span><span
                style="color:#000000;">本公司</span></span><span style="color:#000000;">所</span>作的决定是最终和有约束力。
          </p>
          <p>
            <br>
          </p>
          <h3>
            <span style="color:#00C8E2;font-size:16px;">8. 责任范围</span>
          </h3>
          <p>
            8.1.
          </p>
          <p>
            用户在本公司网站以及参与各项游戏，需自行负担风险。本公司网站以及各项游戏提供商对此不承担任何保证。
          </p>
          <p>
            8.2.
          </p>
          <p>
            在不违反上述规定下，对于用户使用本网站或参与各项游戏所产生的任何损失、金额、费用或损害，无论是直接的、间接的、特别的、衍生的、附带的或其他性质的问题，这个先不要做，下周再说。我找出来给你看。彩票、其董事、员工、合作伙伴、服务供应商一概不负责。
          </p>
          <p>
            8.2.1.
          </p>
          <p>
            用户在此同意，因使用本网站或参与各项游戏所产生的任何金额、费用、损失、损害、索赔与责任，由用户自行负责，与<span><span
                style="color:#000000;">本公司</span></span>与其董事、员工、伙伴与服务供应商无关。
          </p>
          <h3>
            <span style="color:#00C8E2;font-size:16px;">9. 反洗钱</span>
          </h3>
          <p>
            9.1.
          </p>
          <p>
            若用户意识到与本网站的游戏有任何可疑活动，用户必须立即向<span><span style="color:#000000;">本公司</span></span><span
              style="color:#000000;">报</span>告这一情况。
          </p>
          <p>
            9.2.
          </p>
          <p>
            <span><span style="color:#000000;">本公司</span></span>若发现符合“防洗钱法”嫌疑的用户，<span><span
                style="color:#000000;">本公司</span></span>有权暂停、冻结或关闭账户，且扣留账户内资金。
          </p>
          <p>
            9.3.
          </p>
          <p>
            如发现有任何疑似利用本公司网站洗黑钱的情况或事件，应立即提交予相关部门且深入调查，本公司有权没收涉及案件用户的所有款项，或移交至相关部门处理。
          </p>
          <h3>
            <span style="color:#00C8E2;">10. 违规，处罚和终止</span>
          </h3>
          <p>
            10.1.
          </p>
          <p>
            若用户违反上述规则条款或<span><span style="color:#000000;">本公司</span></span>有合理理由怀疑用户违反规定<span
              style="color:#000000;">，</span><span><span style="color:#000000;">本公司</span></span><span
              style="color:#000000;">有</span>权暂停、关闭会员帐号，扣留会员帐户款项（包括存款）以及赔偿用户造成本公司损失。
          </p>
          <p>
            10.2.
          </p>
          <p>
            <span><span
                style="color:#000000;">本公司</span></span>若怀疑用户利用本网站从事非法或诈欺活动，或违反本条款，或用户有债务问题或其他有损于本公司业务的情况，<span><span
                style="color:#000000;">本公司</span></span>有权冻结，或终止该会员帐户，或取消该会员所有赌注，拥有自由裁量权。
          </p>
          <p>
            10.3.
          </p>
          <p>
            用户需知悉最终解释权归<span><span style="color:#000000;">本公司</span></span><span
              style="color:#000000;">所</span>有，若用户违反<span><span style="color:#000000;">本公司</span></span><span
              style="color:#000000;">规则</span>或条款，<span><span
                style="color:#000000;">本公司</span></span>有权暂停或永久禁止该用户再次进入本网站。
          </p>
          <h3>
            <span style="color:#00C8E2;font-size:16px;">11. 知识产权</span>
          </h3>
          <p>
            11.1.
          </p>
          <p>
            <span><span style="color:#000000;">本公司</span></span>是其商标与标志的唯一拥有者。任何未经授权而使用<span><span
                style="color:#000000;">本公司</span></span><span style="color:#000000;">商</span>标和标志，将被起诉。
          </p>
          <p>
            11.2.
          </p>
          <p>
            未经本公司书面同意及授权，其他网站或平台不得于与本网址链接。
          </p>
          <p>
            11.3.
          </p>
          <p>
            本公司网站中使用的技术，软件和业务系统，均属于<span><span style="color:#000000;">本公司</span></span>合法许可人所有。
          </p>
          <p>
            11.4.
          </p>
          <p>
            <span><span style="color:#000000;">本公司</span></span>网页内容与结构均受版权?保护，数据库权利归<span style="color:#000000;">
              [</span><span><span style="color:#000000;">本公司</span></span>]所有且保留所有权利。本网站版权保护涵盖属于<span><span
                style="color:#000000;">本公司</span></span><span
              style="color:#000000;">所</span>有的文字、图形、代码、文件和链接。未经<span><span
                style="color:#000000;">本公司</span></span><span
              style="color:#000000;">先申</span>明或书面同意，不得以任何方式或途径被复制、传输、修改、再版、上传、张贴、传播或分发。用户注册、使用<span><span
                style="color:#000000;">本公司</span></span><span style="color:#000000;">系统，皆</span>未被赋予本公司系统内的任何知识产权权利。
          </p>
          <p>
            11.5.
          </p>
          <p>
            未经<span><span style="color:#000000;">本公司</span></span><span
              style="color:#000000;">事</span>先申明或书面同意，不得与其他网站或所属网页链接。
          </p>
          <p>
            11.6.
          </p>
          <p>
            用户在此同意，不准使用自动或手动装置来监控<span><span style="color:#000000;">本公司</span></span><span
              style="color:#000000;">网页</span>或任何内容。任何未经授权的使用或复制，均可被起诉。
          </p>
          <h3>
            <span style="color:#00C8E2;">12. 可分割性</span>
          </h3>
          <p>
            12.1
          </p>
          <p>
            上述规则与条款中的任何条款如经裁定为非法或不可执行，该条款可视为无效，但不影响其他任何规定及条款的有效性或可实施性。
          </p>
          <h3>
            <span style="color:#00C8E2;">13.分配</span>
          </h3>
          <p>
            13.1
          </p>
          <p>
            对于上述规则与条款<span style="color:#000000;">，</span><span><span
                style="color:#000000;">本公司</span></span>保留分配或以其他方式依法转让的权利。用户无权分配或以其他方式转让。
          </p>
          <h3>
            <span style="color:#00C8E2;">14. 完全同意并接受</span>
          </h3>
          <p>
            14.1.
          </p>
          <p>
            本规则与条款、隐私政策、规则或任何明确文件，共同构成整个协议及当事方之间理解，并取代用户与<span>XXX</span>彩票之间有关本条款与规则主题的先前协议。您同意并承认，签署和接受该规则与条款、隐私政策、规则或任何明确文件。本条款不得用作限制或免除任何因欺诈或欺诈性错误陈述产生的责任。
          </p>
          <p>
            14.2.
          </p>
          <p>
            此项规则条款在相同条件下司法或??行政诉讼的其他业务文档，以任何电子形式通知的印刷版本，均可接纳为依据。
          </p>
        </div>
      </div>"""),
    HelpCenterBean(title: "博彩责任", text: """<div class="g-content">
        <div  class="content">
          <p class="title">
            博彩责任
          </p>
          <p>
            <span style="color:#000000;"><span style="font-size:14px;color:#000000;"><span
                  style=" color:#000000;">本公司</span></span></span><span style="color:#000000;"><span
                style="font-size:14px;"><span
                  style="font-family:microsoft yahei,helvetica,sans-serif;">正在积极努力为玩家提供一个优质的娱乐平台。</span></span></span>
          </p>
          <p>
            <span style="color:#000000;"><span style="font-size:14px;"><span
                  style="font-family:microsoft yahei,helvetica,sans-serif;">以下问题的设置目的在于，我们已经设置升级了多</span></span><span
                style="font-size:14px;"><span
                  style="font-family:microsoft yahei,helvetica,sans-serif;">项安全设施来确保我们游戏的公平公正。</span></span></span>
          </p>
          <p>
            <span style="color:#000000;"><span style="font-size:14px;"><span
                  style="font-family:microsoft yahei,helvetica,sans-serif;">我们鼓励客户通过回答我们的问卷来了解客户对博彩的危害问题的</span></span><span
                style="font-size:14px;"><span style="font-family:microsoft yahei,helvetica,sans-serif;">状况:
                </span></span></span>
          </p>
          <p>
            <span style="color:#000000;"><span style="font-size:14px;"><span
                  style="font-family:microsoft yahei,helvetica,sans-serif;">您会因为躲避工作和学习来进行赌博吗</span></span><span
                style="font-size:14px;"><span
                  style="font-family:microsoft yahei,helvetica,sans-serif;">？</span></span></span>
          </p>
          <p>
            <span style="color:#000000;"><span style="font-size:14px;"><span
                  style="font-family:microsoft yahei,helvetica,sans-serif;">您会因为无聊或者不开心来进行赌博吗？</span></span></span>
          </p>
          <p>
            <span style="color:#000000;"><span style="font-size:14px;"><span
                  style="font-family:microsoft yahei,helvetica,sans-serif;">您在注金投注完时，是否感觉钱已经丢掉或者说要尽快的再次下注？</span></span></span>
          </p>
          <p>
            <span style="color:#000000;"><span style="font-size:14px;"><span
                  style="font-family:microsoft yahei,helvetica,sans-serif;">您会一直赌博直到您的钱都输完吗？
                  您是否有说谎言借钱，甚至盗窃来进行博彩？</span></span></span>
          </p>
          <p>
            <span style="color:#000000;"><span style="font-size:14px;"><span
                  style="font-family:microsoft yahei,helvetica,sans-serif;">您是否刻意隐瞒过您在博彩中会费的时间和资金吗？</span></span></span>
          </p>
          <p>
            <span style="color:#000000;"><span style="font-size:14px;"><span
                  style="font-family:microsoft yahei,helvetica,sans-serif;">您是否不愿意花费您的赌金在其他方面呢？</span></span></span>
          </p>
          <p>
            <span style="color:#000000;"><span style="font-size:14px;"><span
                  style="font-family:microsoft yahei,helvetica,sans-serif;">如果您的大部分答案选择为“是”，您可能已经沉迷于赌博，我们建议您:
                  把博彩当做一种娱乐休闲项目避免</span></span><span style="font-size:14px;"><span
                  style="font-family:microsoft yahei,helvetica,sans-serif;">连续的损失 对博彩有自己的认识 合理安排自己在博彩中的时间和精力 自我隔离:
                  对于一些客户希望暂时远离</span></span><span style="font-size:14px;"><span
                  style="font-family:microsoft yahei,helvetica,sans-serif;">博彩，我们将提供一个自我排除的功能，您可以申请六个月到五年的账户关闭。请点击网页中的“联系我们”，</span></span><span
                style="font-size:14px;"><span
                  style="font-family:microsoft yahei,helvetica,sans-serif;">我们的客服人员会为您带来更多资讯。</span></span></span>
          </p>
          <p>
            <span style="color:#000000;"><span style="font-size:14px;"><span
                  style="font-family:microsoft yahei,helvetica,sans-serif;">年龄限制:
                  18岁以下的人群是禁止赌博的，本站将保有对顾客所提供年龄信息证明的查询，如有发现年龄证明</span></span><span style="font-size:14px;"><span
                  style="font-family:microsoft yahei,helvetica,sans-serif;">与客户所提供的不符，我们将关闭客户的账号以及冻结所剩余的资金。由于各地的法令条款不同，因此我们建</span></span><span
                style="font-size:14px;"><span
                  style="font-family:microsoft yahei,helvetica,sans-serif;">议客户在进行博彩游戏前，翻阅当地法律进行查询。</span></span></span>
          </p>
          <p>
            <span style="color:#000000;"><span style="font-size:14px;"><span
                  style="font-family:microsoft yahei,helvetica,sans-serif;">本站建议禁止您开设多重账号，匿名用户名，以及密码的滥用。本站以诚信为本、顾客至上为服务宗旨，为线上娱乐会员提供资金最有保障、服务最为周全的网络博彩平台。
                </span></span></span>
          </p>
          <p>
            <br>
          </p>
        </div>
      </div>"""),
    HelpCenterBean(title: "隐私政策", text: """<div class="g-content">
        <div class="content">
          <p class="title">
            隐私权政策
          </p>
          <p>
            <span
              style="color:#000000;">本公司</span>十分尊重及重视用户的私隐权，我们将竭力保证您的信息与数据安全。用户的个人资料指关于您的资料，可以包括您的姓名，地址，出生日期，银行卡资料以及其他您可能提供的相关资料。将会尽力确保对您个人资料的使用符合我们运营当地国家<span
              style="color:#E53333;"></span>的数据保护与隐私法规。为此，<span><span style="color:#000000;">本公司</span></span><span
              style="color:#000000;">发</span>出此信息“我们一直遵循的隐私权政策宗旨”。
          </p>
          <p>
            <br>
          </p>
          <p>
            我们致力为客户保护隐私并提供一个最安全的游戏平台，我们在此网站搜集的数据将会为您提供最卓越的服务，我们不会出卖或租赁您的个人资料给第三方，客户所提供的个人资料均经过SSL128位加密技术处理，并储存在安全的、非公开的操作系统，对于有机会接触客户的个人资料的协助伙伴也必需遵守我们订立的隐私保密规则。
          </p>
          <p>
            <br>
          </p>
          <p class="subtitle">
            您的个人信息是否由我们网站收集？
          </p>
          <p>
            若您因获取本公司产品与服务的相关信息及注册账户，而在<span><span style="color:#000000;">本公司</span></span><span
              style="color:#000000;">提</span>供姓名，地址等个人信息，皆属您自愿提供。若您已是<span><span
                style="color:#000000;">本公司</span></span><span
              style="color:#000000;">会员</span>，您可使用密码登录网站后，储存在用户本地终端上的数据(Cookies)将会自动记录，跟踪，辨别用户身份，以便您无须密码即可再次登录。
          </p>
          <p>
            <br>
          </p>
          <p class="subtitle">
            我们将会怎样使用您的个人资料？
          </p>
          <p>
            我们会根据当地数据保护法的规定处理您的个人资料。<span><span
                style="color:#000000;">本公司</span></span>使用您的个人及其他信息的主要目的是：管理账户，维护账户档案，管理网站等级与服务质量，及不定时通知您可能感兴趣相关产品与服务。任何记录所有权归<span><span
                style="color:#000000;">本公司</span></span>所属且仅为上述目的而使用。
            为了确保服务的质量我们会进行监控，其中包括书信或电子邮件的任何通信。公共或私人网站的电子邮件是没有加密。故此，<span><span
                style="color:#000000;">本公司</span></span><span
              style="color:#000000;">特加</span>提醒您，最好不要通过电子邮件的形式向我们发送您的任何个人资料。
          </p>
          <p>
            <br>
          </p>
          <p class="subtitle">
            透漏您的个人资料
          </p>
          <p>
            可能基于上述目的我们需提供或传送您的个人资料给其他相关或附属公司、商业合作伙伴、业务承包商以及支付平台等。我们与这些公司可能会雇用第三方来处理您的个人资料，而此类资料处理均受当地法律规定下的合同约束。按当地法律法规的要求下，您的个人资料也可能会透漏给相关政府部门，监管或执行的权力机构。但请您放心，我们（包括上述所有相关团体）将会采取所有的合理措施来确保阁下信息的保密和安全。
          </p>
          <p>
            <br>
          </p>
          <p class="subtitle">
            同意
          </p>
          <p>
            提交您的信息并注册账户及使用网站即表示您已同意<span><span
                style="color:#000000;">本公司</span></span>根据本隐私政策使用您的信息,处理及透漏您的个人资料，并允许本公司为您提供产品及游戏服务。若您想通过限定，调整，修改或限制您同意的状态，请您联系我们的客服部门。
          </p>
        </div>
      </div>"""),
    HelpCenterBean(title: "代理条件", text: """<div class="g-content">
        <img src="/images/mine/agent1.png" alt="">
        <img src="/images/mine/agent2.png" alt="">
        <img src="/images/mine/agent3.png" alt="">
        <img src="/images/mine/agent4.png" alt="">
        <img src="/images/mine/agent5.png" alt="">
        <img src="/images/mine/agent6.png" alt="">
        <img src="/images/mine/agent7.png" alt="">

    </div>"""),
    HelpCenterBean(title: "推广赚钱", text: """<div class="g-content">
        <div data-v-40a3d258="" class="content">
          <p>
            <br>
          </p>
          <p class="title">
            1.如何才能够赚取推广红利呢？
          </p>
          <p>
            答：您好，只需要您已经注册成为<span><span style="color:#000000;">本网站</span></span>会员即可的。
          </p>
          <p class="title">
            2.我已经是会员了，有会员账号的那我要怎么做呢？
          </p>
          <p>
            答：您好，请您登入您的会员账号，登入后点击“我的”-“推广赚钱”-“分享”，把二维码发送给您的朋友进行注册即可的。
          </p>
          <p class="title">
            3.我分享给我朋友了，那我怎么查看我的福利呢？
          </p>
          <p>
            答：您好，请您登入您的会员账号，登入后点击“我的”-“推广赚钱”-“查看推广红利记录”即可查询。
          </p>
          <p class="title">
            3.我的推广红利要提款，为什么要扣手续费呢？
          </p>
          <p>
            答：您好，推广红利是需要您达到一倍的打码才可以出款的哦。
          </p>
        </div>
      </div>"""),
    HelpCenterBean(title: "摇奖规则", text: """<div class="g-content">
        <div class="content">
          <p class="subtitle">
            1. 每5积分可进行一次积分摇奖。
          </p>
          <p class="subtitle">
            2. 签到一次可获得5积分,每天限签到一次。
          </p>
          <p class="subtitle">
            3. 有效打码1000元可以获得1积分，即时到积分帐户。
          </p>
          <p class="subtitle">
            4. 转盘金额1.8元到18880元不等，只要积分馀额足够或是签到一次，即可参加摇奖。
          </p>
          <p class="subtitle">
            5. 会员所获奖金需在2周内完成1倍奖金有效打码即可取款，过期将失效。
          </p>
          <p class="subtitle">
            6. 积分在每年1月1日归零。
          </p>
          <p class="subtitle">
            7. 本活动不与网站其它优惠冲突 。
          </p>
          <p class="subtitle">
            8. 本活动同姓名、同ip、同电话号码、同银行卡,依系统判定只能有一个帐户获得领取奖金机会，对于涉嫌套取本活动优惠奖金会员，网站有权不予发放。
          </p>
          <p class="subtitle">
            9. 本网站保留在任何时候终止或修改本活动规则及内容，最终解释权归本网站所有。
          </p>
        </div>

      </div>"""),
    HelpCenterBean(title: "返水说明", text: """<div class="g-content">
        <div data-v-40a3d258="" class="content">
          <p>
            <br>
          </p>
          <h2>
            <span style="color:#4393FF;">返水说明</span>
          </h2>
          <h2>
            <span style="color:#E53333;">【DT-PC28蛋蛋返水说明】</span>
          </h2>
          <p>
            <span style="font-size:14px;">DT-PC28蛋蛋返水为负盈利返水；系统<span style="color:#337FE5;">自动计算</span>返水数量，<span
                style="color:#337FE5;">自动进行返水</span>；系统默认会查询<span style="color:#337FE5;">近一周</span>的数据进行呈现；</span>
          </p>
          <h2>
            <span style="color:#E53333;">【其他游戏返水说明】</span>
          </h2>
          <p>
            <span style="font-size:14px;">其他游戏为打码量返水，会员在</span><span
              style="color:#337FE5;font-size:14px;">DT-经典彩票，DT-官方彩票，AG真人视讯，MG电游等</span><span
              style="font-size:14px;">游玩产生打码量时，即可产生返水；返水数值<span
                style="color:#337FE5;">一般在下一日的下午四点钟呈现</span>（取决于网站运营是否直接决定返水给会员，如系统已经在下一日下午4点计算出返水数量，运营在后台设置未统一出款，则无数据）；本站返水计算时间为美东时间；系统默认会查询近一周的数据进行呈现；</span>
          </p>
          <p>
            <br>
          </p>
        </div>
      </div>"""),
    HelpCenterBean(title: "新版说明", text: """<div class="g-content">
        <div class="content">
          <div id="write" class="is-mac">
            <h3>
              <a ></a><span style="color:#337FE5;">新版说明</span>
            </h3>
            <p>
              Hi，there！我们很激动（傲娇）的告诉大家，我们“焕”新了！新版有哪些亮点？看这里！看这里！
            </p>
            <ol>
              <li>
                我们改进了游戏的陈列方式。好用的经典彩，官方彩等这次再也不用躲躲藏藏了！你可以在首页点击你想要进入的彩种，咻的一下就直达游戏的界面了，很爽快有木有？若你想要返回到彩种的列表页面，只要轻触左上角的&lt;返回&gt;按钮即可。
              </li>
              <li>
                我们新增了很多的游戏。AG真人，BBIN真人，MG，AG，BBIN，PT电游，BBIN体育等精彩游戏会先后到你的面前报道。从此，一个就够了。
              </li>
              <li>
                我们新增了iPhoneX的适配，并优化了大部分机器上的显示。为了适配，我们的工程师小哥不眠不休的又又又又加班了。
              </li>
            </ol>
            <h3>
              <a name="undefined"></a><span style="color:#337FE5;">Q&amp;A</span>
            </h3>
            <ol>
              <li>
                <p class="subtitle">
                  <span style="color:#337FE5;">Q：新版的改版和之前的版本有何区别？</span>
                </p>
                <p>
                  A：视觉！视觉！视觉！重要的事情说三遍！我们大大的提升了视觉的辨识度，高端大气上档次有木有？交互我们也做出了大幅的改进，更多细节待你去体验。
                </p>
              </li>
              <li>
                <p  class="subtitle">
                  <span style="color:#337FE5;">Q：相较于之前的游戏，你们做出了那些变动？</span>
                </p>
                <p>
                  A：我们增加了一些游戏种类，如PT电游，BBIN体育。我们同时改进了游戏的打开姿势，新增了经典彩和官方 彩的直达通道，让你更快进入游戏，赢在领先。
                </p>
              </li>
              <li>
                <p  class="subtitle">
                  <span style="color:#337FE5;">Q：新版还有哪些改动？</span>
                </p>
                <p>
                  A：我们还添加了QQ扫码支付，只要你点击充值就可以看到了。
                </p>
              </li>
              <li>
                <p  class="subtitle">
                  <span style="color:#337FE5;">Q：有新的活动吗？</span>
                </p>
                <p>
                  A：有！正在路上。
                </p>
              </li>
            </ol>
          </div>
        </div>
      </div>"""),
    HelpCenterBean(title: "防劫持教程", text: """<div class="g-content">
        <div  class="content">
          <h1>
            防劫持说明
          </h1>
          <h2>
            <span> </span>一、手机版
          </h2>
          <h3>
            <span> </span>iOS
          </h3>
          
          <ol>
            <li style="font-size:14px;">
              
              <span> </span>点击&nbsp;iOS&nbsp;的&nbsp;【设置】
            </li>
            
            <img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/79f6261179c2fbad0bf7318b84f10b6f.png"
              alt="">
            
            <li style="font-size:14px;">
              
              <span> </span>点击&nbsp;【Wi-Fi&nbsp;】进入&nbsp;Wi-Fi&nbsp;列表选择可用&nbsp;Wi-Fi ；
            </li>
            
            <img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/fc38c109dc80cff5e3daf15f297278a5.png"
              alt="">
            
            <li style="font-size:14px;">
              
              <span> </span>连接上对应的Wi-Fi之后，点击右侧的图标 ；
            </li>
            
            <img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/4bb3a9377c17698a64b090f5371d5c97.png"
              alt="">
            
            <li style="font-size:14px;">
              
              <span>
              </span>在该&nbsp;Wi-Fi&nbsp;网络详情部分向下滚动找到&nbsp;【DNS】&nbsp;选项部分,&nbsp;在弹出的键盘上输入您需要更改的&nbsp;DNS&nbsp;数值,使用&nbsp;【8.8.8.8】
            </li>
            
            <img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/5ce7c38206d52bac06a113e9a2c37c2f.png"
              alt="">
            
            <li style="font-size:14px;">
              
              <span> </span>返回上一级,&nbsp;并重启设备使设置生效 。
            </li>
            
            <img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/531ba0086a09f9642c8313e58e6db434.png"
              alt="">
            
            <span> </span>
          </ol>
          
          <span> </span>
          <h3>
            
            <span> </span>Android
            <span> </span>
          </h3>
          
          <ol>
            <span> </span>
            <li style="font-size:14px;">
              
              <span> </span>点击安卓的&nbsp;【设置】&nbsp;设置&nbsp;；
              <span> </span>
            </li>
            
            <img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/356bb83b05588bc0d567efaf4febd510.png"
              alt="">
            
            <span> </span>
            <li style="font-size:14px;">
              
              <span> </span>点击&nbsp;WLAN&nbsp;选项打开&nbsp;Wi-Fi&nbsp;列表 ；
              <span> </span>
            </li>
            
            <img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/7a149b400bf83237ef5d49ae2a46d9c9.png"
              alt="">
            
            <span> </span>
            <li style="font-size:14px;">
              
              <span> </span>在&nbsp;Wi-Fi&nbsp;列表选择已连接的&nbsp;Wi-Fi&nbsp;名称,&nbsp;长按之后选择&nbsp;【修改网络】
              <span> </span>
            </li>
            
            <img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/6427e29eb9a551dcf10443b0a9f0e317.png"
              alt="">
            
            <span> </span>
            <li style="font-size:14px;">
              
              <span> </span>选择【显示高级选项】
              <span> </span>
            </li>
            
            <img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/0640d1e108bb2169e22ec22a6711150a.png"
              alt="">
            
            <span> </span>
            <li style="font-size:14px;">
              
              <span> </span>点击&nbsp;【IP&nbsp;设置】
              <span> </span>
            </li>
            
            <img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/eba3b980654ebf10c81da5baed8bc3bc.png"
              alt="">
            
            <span> </span>
            <li style="font-size:14px;">
              
              <span> </span>在弹出的&nbsp;IP&nbsp;提示中选择&nbsp;【静态】
              <span> </span>
            </li>
            
            <img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/954d4a909d110a21b28126f5b82a2cea.png"
              alt="">
            
            <span> </span>
            <li style="font-size:14px;">
              
              <span>
              </span>将域名1&nbsp;和域名2&nbsp;改成需要更改的&nbsp;DNS&nbsp;数值，本例中我们使用&nbsp;8.8.8.8&nbsp;和&nbsp;8.8.4.4&nbsp;,&nbsp;然后点击&nbsp;【保存】即可
              。
              <span> </span>
            </li>
            
            <img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/d74e826a25042496790a952816065630.png"
              alt="">
            
          </ol>
          
          <h2>
            
            <span> </span>二、电脑版
          </h2>
          
          <h3>
            
            <span> </span>Windows 10
          </h3>
          
          <p>
            
            <span> </span><span><img
                src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/23fa1a1a4472d01c828b2c9bd2ff51a4.png"
                alt=""> </span>
          </p>
          
          <p>
            
            <span> </span><span><img
                src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/4c1d2d7edddca351e4451920c7d00f5e.png"
                alt="">
              
            </span>
          </p>
          
          <h3>
            
            <span> </span><img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/229431d34536e019036a984cc5d50741.png"
              alt="">
            
          </h3>
          
          <h3>
            
            <span> </span><img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/66bfaf447e891063d5c3746a3686b47e.png"
              alt="">
            
          </h3>
          
          <h3>
            
            <span> </span><img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/512a16a470dc787c1a0c060fad25cdf0.png"
              alt="">
            
          </h3>
          
          <p>
            
            <span> </span><img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/a06704afe81f64f57199195adc098d4c.png"
              alt="">
          </p>
          
          <p>
            
            <span> </span><img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/f277ba44cfd65d2cd87d3183caf4d323.png"
              alt="">
          </p>
          
          <p>
            
            <span> </span>
          </p>
          
          <h3>
            
            <span> </span>Windows 8
          </h3>
          
          <p>
            
            <span> </span><img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/04c0aa926811a115228f88c683ffb253.png"
              alt="">
          </p>
          
          <p>
            
            <span> </span><img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/30de76eb900e3235aa101b866eb48881.png"
              alt="">
          </p>
          
          <p>
            
            <span> </span><img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/8fda6df2f5e5902ba8b5000b92abd797.png"
              alt="">
          </p>
          
          <p>
            
            <span> </span><img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/1578732396a522913b6891bcc3210377.png"
              alt="">
          </p>
          
          <p>
            
            <span> </span><img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/039b5b4b1d3993d71e0938ed31f7bba1.png"
              alt="">
          </p>
          
          <p>
            
            <span> </span><img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/5014d88f60b3ad6493829bbdc479fba7.png"
              alt="">
          </p>
          
          <p>
            
            <span> </span><img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/1f4e0ef9b8ca7cc929cd9ae2d1d5a719.png"
              alt="">
          </p>
          
          <p>
            
            <span> </span><img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/3b107cff4d8b551b2e3d847065f269c0.png"
              alt="">
          </p>
          
          <p>
            
            <span> </span>
          </p>
          
          <h3>
            
            <span> </span>Windows 7
          </h3>
          
          <p>
            
            <span> </span><img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/49c4aaef58bafff64bb0ccefa09b75f7.png"
              alt="">
          </p>
          
          <p>
            
            <span> </span><img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/59ba9891690d83995b3750c19f991d43.png"
              alt="">
          </p>
          
          <p>
            
            <span> </span><img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/2e208edcd60b66dda0e6d9ed206db3c3.png"
              alt="">
          </p>
          
          <p>
            
            <span> </span><img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/9ab046e85f39d37bc8d66de7fba05932.png"
              alt="">
          </p>
          
          <p>
            
            <span> </span><img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/d9cb28acd28dc79951e731164c6c21a3.png"
              alt="">
          </p>
          
          <p>
            
            <span> </span><img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/c6bc1555d574079dd87bf5da644ab8ca.png"
              alt="">
          </p>
          
          <p>
            
            <span> </span><img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/e223c62288932fae8d644cbdb7937308.png"
              alt="">
          </p>
          
          <p>
            
            <span> </span>
          </p>
          
          <h3>
            
            <span> </span>Windows XP
          </h3>
          
          <p>
            
            <span><img
                src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/b8b695bf5440d6c752327e7e6ebf6b46.png"
                alt="">
              
            </span>
          </p>
          
          <p>
            
            <span><img
                src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/432e2206bacb3709e67016b76a166c98.png"
                alt="">
              
            </span>
          </p>
          
          <p>
            
            <span><img
                src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/6e0b29b39842454e1e52102fe239bc8e.png"
                alt="">
              
            </span>
          </p>
          
          <p>
            
            <span> <img
                src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/8b13a994c3431f273f6ccf49f510182a.png"
                alt=""></span>
          </p>
          
          <h2>
            
            <span> </span><img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/7b130f0f12e65680db16023bd62c39f4.png"
              alt="">
            
          </h2>
          
          <p>
            
            <span> </span>
          </p>
          
          <h2>
            
            <span> </span>三、平板电脑
          </h2>
          
          <h3>
            
            <span> </span>iPad
          </h3>
          
          <ol>
            <li style="font-size:14px;">
              
              <span> </span>点击&nbsp;ipad&nbsp;的&nbsp;【设置】
            </li>
            
            <img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/c7e9b3c020bf5ddded6beef6e89a9d83.png"
              alt="">
            
            <li style="font-size:14px;">
              
              <span> </span>点击&nbsp;【Wi-Fi&nbsp;】进入&nbsp;Wi-Fi&nbsp;列表选择可用&nbsp;Wi-Fi ；
            </li>
            
            <img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/e9485b307e1c5159c625d548e35725ff.png"
              alt="">
            
            <li style="font-size:14px;">
              
              <span> </span>在该&nbsp;Wi-Fi&nbsp;网络详情的下面找到&nbsp;【DNS】选项部分 ；
            </li>
            
            <img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/3d79bfb4c6030df282f4a2881ef03db6.png"
              alt="">
            
            <li style="font-size:14px;">
              
              <span> </span>修改配置&nbsp;DNS&nbsp;为&nbsp;【手动】
            </li>
            
            <img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/4b76ca68b663845bf0a402bc7b5b2984.png"
              alt="">
            
            <li style="font-size:14px;">
              
              <span> </span>在弹出的键盘上输入您需要更改的&nbsp;DNS&nbsp;数值,&nbsp;本例子中我们使用&nbsp;【8.8.8.8】
            </li>
            
            <img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/8a1e4f955b68c8d6ca320c5e67994b82.png"
              alt="">
            
            <li style="font-size:14px;">
              
              <span> </span>返回上一级,&nbsp;并重启设备使设置生效 。
            </li>
            
            <img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/1add1c71fe5111304f659d0f0db3aab6.png"
              alt="">
            
            <span> </span>
          </ol>
          
          <span> </span>
          <h3>
            
            <span> </span>Android Pad
            <span> </span>
          </h3>
          
          <ol>
            <span> </span>
            <li style="font-size:14px;">
              
              <span> </span>点击安卓的&nbsp;【设置】
              <span> </span>
            </li>
            
            <img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/0bc686aa29ae0c7dcbcfd3fe2224ab75.png"
              alt="">
            
            <span> </span>
            <li style="font-size:14px;">
              
              <span> </span>点击&nbsp;Wi-Fi&nbsp;选项打开&nbsp;Wi-Fi&nbsp;列表 ；
              <span> </span>
            </li>
            
            <img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/ea9995b69230aecc0e32f1033bd9689a.png"
              alt="">
            
            <span> </span>
            <li style="font-size:14px;">
              
              <span> </span>在&nbsp;Wi-Fi&nbsp;列表选择已连接的&nbsp;Wi-Fi&nbsp;名称,&nbsp;长按之后选择【修改网络 】
              <span> </span>
            </li>
            
            <img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/2fe16ab4f7ae4906930f870efc55bb98.png"
              alt="">
            
            <span> </span>
            <li style="font-size:14px;">
              
              <span> </span>选择【显示高级选项】
              <span> </span>
            </li>
            
            <img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/dc1ee50b30b32a500dbf997a4779585a.png"
              alt="">
            
            <span> </span>
            <li style="font-size:14px;">
              
              <span> </span>点击&nbsp;【IP&nbsp;设置】&nbsp;在弹出的&nbsp;IP&nbsp;提示中选择&nbsp;【静态】
              <span> </span>
            </li>
            
            <img
              src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/2c3338c19902b7b4d46bd38841654355.png"
              alt="">
            
            <span> </span>
            <li style="font-size:14px;">
              
              <span>
              </span>将域名1&nbsp;和域名2&nbsp;改成需要更改的&nbsp;DNS&nbsp;数值，本例中我们使用&nbsp;8.8.8.8&nbsp;和&nbsp;8.8.4.4&nbsp;,&nbsp;然后点击&nbsp;【保存】即可
              。
              <span> </span>
            </li>
            
            <img
            src="https://dt-imgs.oss-cn-shanghai.aliyuncs.com/uploads/6000/news/bc8fb0d6cc4e19ce5fa27a9e6139de0e.png"
            alt="">
          
        </ol>
        
      </div>
    </div>"""),
    HelpCenterBean(title: "版本记录", text: """<div class="g-content">
        <div  class="content">
          <p class="MsoNormal">
            <strong>版本记录</strong>
          </p>
          <p class="MsoNormal">
          </p>
          <p class="MsoNormal">
            <strong>DT-V3.1 </strong><span style="color:#337FE5;">（new）</span>
          </p>
          <p class="MsoNormal">
            <span>更新内容：</span>
          </p>
          <p class="MsoNormal">
            1.新增GOPay<br>
            2.优化公告栏滚动速度<br>
            3.安卓app版本升级优化<br>
            4.PC端KY棋牌二级页面新增游戏
          </p>
          <p class="MsoNormal">
            <br>
          </p>
          <p class="MsoNormal">
            <strong>DT-V3.0.5</strong> 2022-3-28
          </p>
          <p class="MsoNormal">
            <span>更新内容：</span><br>
            1.APP更换线路获取方式<br>
            2.注册登录页面新增验证码
          </p>
          <p></p>
          <p class="MsoNormal">
            <br>
          </p>
          <p class="MsoNormal">
            <strong>DT-V3.0.4&nbsp;</strong>2021-11-23
          </p>
          <p class="MsoNormal">
            <span>更新内容：</span>
          </p>
          <p class="MsoNormal">
            1.新增OB视讯<br>
            2.新增OB体育<br>
            3.优化客服页面<br>
            4.修复已知bug 优化用户体验
          </p>
          <p class="MsoNormal">
            <br>
          </p>
          <p class="MsoNormal">
            <strong>DT-V3.0.3</strong> 2021-4-5
          </p>
          <p class="MsoNormal">
            <span>更新内容：</span><br>
            1.积分自定义有效期<br>
            2.支持绑定多张银行卡<br>
            3.充值页面快捷按钮配置<br>
            4.稽核时效手续费<br>
            5.免转钱包<br>
            6.游戏下架<br>
            7.会员登录/注册支持滑动验证码<br>
            8.数字货币充值/提现页面新增操作帮助按钮<br>
            <br>
            <strong>DT-V3.0.2</strong> 2020-12-7
          </p>
          <p class="MsoNormal">
            <span>更新内容：</span><br>
            1.充值模块新增USDT线上支付（数字货币更名USDT）<br>
            2.充值模块新增CGPay线上线下支付<br>
            3.提现模块新增CGPay<br>
            4.经典彩/官方彩游戏调整（下架游戏不展示）<br>
            5.余额宝功能<br>
            6.PC蛋蛋游戏下架：北京28，比特币3分，美国俄勒冈，斯洛伐克彩种<br>
            7.移动端开奖走势功能中新增各彩种走势图表<br>
            <br>
            <strong>DT-V3.0.1</strong> 2020-10-30
          </p>
          <p class="MsoNormal">
            <span>更新内容：</span><br>
            1. 电游热度值显示与电游收藏<br>
            2. 多次摇奖功能<br>
            3. 支持云闪付充值方式<br>
            4. USDT线上/线下充值功能 USDT提现功能<br>
            5. CGPay线上/线下充值功能&nbsp; CGPay提现功能<br>
            6. 新增天豪棋牌<br>
            7. 移动端首页新版样式及部分UI细节调整<br>
            8. 性能优化与bug修复<br>
            9. WM电游 （因外接平台原因暂定维护）<br>
            <br>
            <strong>DT-V3.0.0</strong> 2019-12-1
          </p>
          <p class="MsoNormal">
            <span>更新内容：</span><br>
            1.PC端帮助中心页面规范调整<br>
            2.PC端PC28蛋蛋页面规范调整<br>
            3.PC端推广赚钱页面规范调整<br>
            4.移动端新增模板二
          </p>
          <p class="MsoNormal">
            <br>
          </p>
          <p class="MsoNormal">
            <span><strong>DT-V2.9.0</strong>&nbsp;</span><span>2019-10-5</span>
          </p>
          <p class="MsoNormal">
            <span><span>更新内容：</span><br>
            </span>
          </p>
          <p class="MsoNormal">
            红包功能<br>
            1. 调整抢条件：新增层级条件，将近一周打码量改为当日打码量，且所有条件可以自由组合<br>
            聊天室功能<br>
            1. 聊天室入口控制：可控制前台是否展示聊天室入口<br>
            2. 聊天室发言条件优化：新增层级条件，新增当日充值金额条件，将近一周打码量改为当日打码量，且所有条件可以自由组合<br>
            3. 聊天管控页签显示会员昵称<br>
            4. 聊天管控页签可设置管理员头像<br>
            5. 聊天室清屏时后台记录对应清除<br>
            6. 进入聊天室显示历史消息<br>
            7. 聊天室顶部开奖信息展示<br>
            8. 进场特效<br>
            9. 聊天室计划<br>
            10. 聊天室红包<br>
            11. @他人<br>
            12. 部分界面优化，更加美观
          </p>
          <p class="MsoNormal">
            <br>
          </p>
          <p class="MsoNormal">
            <strong>DT-V2.8.0</strong>&nbsp;2019-7-5
          </p>
          <p class="MsoNormal">
            <span>更新内容：</span>
          </p>
          <p class="MsoNormal">
            1. 新增抢红包功能。
          </p>
          <p class="MsoNormal">
            2. 新增聊天室。
          </p>
          <p class="MsoNormal">
            3. 新增LMG视讯。
          </p>
          <p class="MsoNormal">
            4. 新增CQ9电游。
          </p>
          <p class="MsoNormal">
            5. 登录/注册/个人中心/PC28蛋蛋投注页面优化。
          </p>
          <p class="MsoNormal">
            6. 修复若干BUG。&nbsp; &nbsp;
          </p>
          <p>
            <br>
          </p>
          <p class="MsoNormal">
            <strong>DT-V2.7.0</strong> 2019-4-3
          </p>
          <p class="MsoNormal">
            <span>更新内容：</span>
          </p>
          <p class="MsoNormal">
            1. 新增VG棋牌游戏。
          </p>
          <p class="MsoNormal">
            2. 新增比特币1分28、比特币3分28彩种，房间带号源校验功能。
          </p>
          <p class="MsoNormal">
            3. DT-PC28蛋蛋 下架新疆28，重庆28。
          </p>
          <p class="MsoNormal">
            4. 我的页面-消息，增加一键 标记全部已读功能。
          </p>
          <p class="MsoNormal">
            5. 用户设置昵称由原来的支持2-12位中文，字母和数字改为2-5位中文，字母和数字。
          </p>
          <p class="MsoNormal">
            6. 支付区间配置功能。 &nbsp;&nbsp;
          </p>
          <p class="MsoNormal">
            7. 调整会员返水、回水/积分记录的查询时间范围。
          </p>
          <p class="MsoNormal">
            8. 修复一些BUG。
          </p>
          <p class="MsoNormal">
            &nbsp;
          </p>
          <p class="MsoNormal">
            <strong>DT-V2.6.0</strong> 2019-1-14
          </p>
          <p class="MsoNormal">
            <span>更新内容：</span>
          </p>
          <p class="MsoNormal">
            1. 更换PC28房间背景音乐。
          </p>
          <p class="MsoNormal">
            2. 调整首页线路选择页面。
          </p>
          <p class="MsoNormal">
            3. 调整首页-开奖走势页面。
          </p>
          <p class="MsoNormal">
            4. 轮播跳转-增加跳转到经典彩、官司方彩和充值页功能（请在图片站设置）。
          </p>
          <p class="MsoNormal">
            5. 调整我的-消息-公告页面。
          </p>
          <p class="MsoNormal">
            6. 修改我的-资金交易/投注记录，去掉时间选择控件，直接点击选择按钮来操作。
          </p>
          <p class="MsoNormal">
            &nbsp;&nbsp;&nbsp;<span>资金交易前台数据可查范围限定为近</span>15天；按钮为：昨天 &nbsp;&nbsp;近7天 &nbsp;近15天。
          </p>
          <p class="MsoNormal">
            &nbsp;&nbsp;&nbsp;<span>投注记录前台数据可查范围限定为近</span>7天；按钮为：今天 &nbsp;近7天。
          </p>
          <p class="MsoNormal">
            7. 调整房间聊天功能-短语排版、动图排版页面。
          </p>
          <p class="MsoNormal">
            &nbsp;
          </p>
          <p class="MsoNormal">
            <strong>DT-V2.5.0</strong> 2018-11-1
          </p>
          <p class="MsoNormal">
            <span>更新内容：</span>
          </p>
          <p class="MsoNormal">
            1. 首页新增开奖走势功能，查看历史开奖信息更便捷啦！
          </p>
          <p class="MsoNormal">
            2. 房间内有趣Emoji、Gif表情，线上互动趣味十足。
          </p>
          <p class="MsoNormal">
            3. 更换头像功能上线啦，点击头像试试吧！
          </p>
          <p class="MsoNormal">
            4. 充值页随处可见充值记录详情，也来试试吧！
          </p>
          <p class="MsoNormal">
            5. 改版“我的”页面（"关于"增加手动检查更新功能、调整投注记录/会员返水页面）。
          </p>
          <p class="MsoNormal">
            6. 启动页广告图、轮播跳转配置，请到图片站进行相关配置噢~
          </p>
          <p class="MsoNormal">
            7. 修复若干Bug。
          </p>
          <p class="MsoNormal">
            <b>&nbsp;</b>
          </p>
          <p class="MsoNormal">
            <strong>DT-V2.4.1</strong> 2018-9-28
          </p>
          <p class="MsoNormal">
            <span>更新内容：</span>
          </p>
          <p class="MsoNormal">
            1.DT-PC28蛋蛋新增快捷短语和表情分类功能
          </p>
          <p class="MsoNormal">
            2.DT-PC28蛋蛋新增后台发消息到房间功能
          </p>
          <p class="MsoNormal">
            &nbsp;
          </p>
          <p class="MsoNormal">
            <strong>DT-V2.4.0</strong>&nbsp;&nbsp;2018-9-3
          </p>
          <p class="MsoNormal">
            <span>更新内容：</span>
          </p>
          <p class="MsoNormal">
            1.旧图片站迁移至新图片站。
          </p>
          <p class="MsoNormal">
            2.新增有趣Emoji表情，线上互动趣味十足。
          </p>
          <p class="MsoNormal">
            3.PC28系列支持在房间内自由切换彩种和房间列表啦！
          </p>
          <p class="MsoNormal">
            4.网站下载页大焕新！！！能否让您亮眼？
          </p>
          <p class="MsoNormal">
            5.增加更多游戏加载选择方式，快来试试吧！
          </p>
          <p class="MsoNormal">
            6.改版“我的”页面（提现/额度转换/资金交易/提取奖金）。
          </p>
          <p class="MsoNormal">
            7.添加验证码功能
          </p>
          <p class="MsoNormal">
            <b>&nbsp;</b>
          </p>
          <p class="MsoNormal">
            <strong>DT-V2.3.0</strong>&nbsp;&nbsp;2018-7-24
          </p>
          <p class="MsoNormal">
            更新内容：
          </p>
          <p class="MsoNormal">
            <span>1.【</span>AG体育】继世界杯热潮，您的体育竞猜还有更多选择。
          </p>
          <p class="MsoNormal">
            <span>2.【</span>MG电游】邂逅MG电游，这个夏天惊喜不断！
          </p>
          <p class="MsoNormal">
            3.【下载提示】首页下载新方式，全新呈现，华丽登场！
          </p>
          <p class="MsoNormal">
            4.【新版客服】客服功能全新改版，随心沟通无阻碍。
          </p>
          <p class="MsoNormal">
            5.【线路切换】新增首页下拉线路切换功能；房间内线路切换全新改版。
          </p>
          <p class="MsoNormal">
            <span>6.【露珠页面】房间内开奖结果简单直观更可靠</span>~
          </p>
          <p class="MsoNormal">
            <span>7.【</span>Bug fix】努力修复了N个bug，只为更好的体验，更好的您！
          </p>
          <p class="MsoNormal">
            &nbsp;
          </p>
          <p class="MsoNormal">
            <strong>DT-V2.2.0</strong> &nbsp;2018-6-13
          </p>
          <p class="MsoNormal">
            <span>更新内容：</span>
          </p>
          <p class="MsoNormal">
            <span>1.【</span>H8体育】世界杯期间，您的体育竞猜又多了一种选择。
          </p>
          <p class="MsoNormal">
            <span>2.【新版首页】</span>PC28，我们最出彩！
          </p>
          <p class="MsoNormal">
            <span>3.【</span>KY棋牌】全新棋牌上线~斗地主牛牛全都有~
          </p>
          <p class="MsoNormal">
            <span>4.【细节优化】全新趣味</span>tabbar图标，重绘个人中心图标，更多细节，等您来发现。
          </p>
          <p class="MsoNormal">
            <span>5.【</span>Bug fix】努力修复了N个bug，只为更好的体验，更好的您！
          </p>
          <p class="MsoNormal">
            &nbsp;
          </p>
          <p class="MsoNormal">
            <strong>DT-V2.1.0 </strong>&nbsp;2018-5-5
          </p>
          <p class="MsoNormal">
            更新内容：
          </p>
          <p class="MsoNormal">
            1.新增四个新彩种。
          </p>
          <p class="MsoNormal">
            2.新增定位球投注方式。
          </p>
          <p class="MsoNormal">
            3.新增跟投功能。
          </p>
          <p class="MsoNormal">
            4.充值页面修改。
          </p>
          <p class="MsoNormal">
            &nbsp;
          </p>
          <p class="MsoNormal">
            <strong>DT-V2.0.0</strong> &nbsp;2018-3-29
          </p>
          <p class="MsoNormal">
            更新内容：
          </p>
          <p class="MsoNormal">
            1.全新支付V3版本上线。梳理了支付方式，现在以“你”为中心。
          </p>
          <p class="MsoNormal">
            2.全新露珠走势功能。露珠在手，下注高手~在之前的开奖结果列表即可查看。
          </p>
          <p class="MsoNormal">
            3.新版V2咪牌。咪出个天地，新新新版，欢迎调戏。
          </p>
          <p class="MsoNormal">
            4.界面优化，功能修复。
          </p>
          <p class="MsoNormal">
            &nbsp;
          </p>
          <p class="MsoNormal">
            <strong>DT-V1.0.0</strong> &nbsp;2018-2
          </p>
        </div>
      </div>"""),
  ];
}

class HelpCenterBean {
  String title;
  String text;
  HelpCenterBean({required this.title, required this.text});
}
