// 充值配置
const Map<int, int> rechargeGetWay = {
  10: 1, // 支付宝
  11: 1, // 微信
  23: 1, // WEB网上银行
  24: 1, // WAP网上银行
  25: 1, // QQ钱包
  28: 1, // 支付宝支付网关
  29: 1, // 微信支付网关
  30: 1, // QQ钱包网关
  33: 1, // 银联
  34: 1, // 京东钱包
  35: 1, // 苏宁支付
  36: 1, // 翼支付
  37: 1, // 美团支付
  38: 1, // 百度钱包
  39: 1, // 小米钱包
  187: 1, // 虚拟货币
  189: 1, // Momo pay
  190: 1, // zalo pay
  195: 1, // UPI
  197: 1, // PAYTM
  199: 1, // picpay pay
  203: 1, // PIX
  260: 1, // JAAZCASH
  262: 1, // EASYPAISA
  300: 1, // 数字人民币
  302: 1, // 博币
  304: 1, // OKPAY
  305: 1, // GOPAY
  306: 1, // TOPAY
  307: 1, // AGPAY
  308: 1, // NOPAY
  309: 1, // 购宝钱包
  65: 1, // PayNow钱包
  310: 1, // 电子钱包
  312: 1, // wbpay
  314: 1, // mpay
  316: 1, // k豆钱包
  318: 1, // c币钱包
  320: 1, // 988PAY
  322: 1, // gCash
  324: 1, // IPAY
  326: 1, // 波币
  328: 1, // Aipay钱包
  330: 1, // 808钱包
  332: 1, // JDPAY钱包
  334: 1, // FPAY钱包
  336: 1, // FPAY钱包
};
