
//todo：0103。盘口类型接口
//获取列表投注项 bettype/filter
//这只接口返回的字段增加 egi
//原本是用bt 来跟 event/list 取回来的资料做对应, 需要改成用 bt 跟egi 都要相同来对应


//todo: 体育详情页比分逻辑
///业务逻辑 备注；
//SportMatchModel -   Map<String, String>? pol; 的比分逻辑：
//   前端处理这个赛果数据时除了23、24、35、36不展示，其他的数据有就展示哈
//   5,   // 黄牌 主队
//   6,   // 黄牌 客队
//   7,   // 角球 主队 足球
//   8,   // 角球 客队 足球
//   9,   // 上半场 主队 篮球, 足球
//   10,  // 上半场 客队 篮球, 足球
//   11,  // 下半场 主队 篮球, 足球
//   12,  // 下半场 客队 篮球, 足球
//   13,  // 第一节 主队 篮球
//   14,  // 第一节 客队 篮球
//   15,  // 第二节 主队 篮球
//   16,  // 第二节 客队 篮球
//   17,  // 第三节 主队 篮球
//   18,  // 第三节 客队 篮球
//   19,  // 第四节 主队 篮球
//   20,  // 第四节 客队 篮球
//   21,  // 加时 主队 篮球
//   22,  // 加时 客队 篮球
//
//
//   23,  // 让分局 主队 网球
//   24,  // 让分局 客队 网球
//
//   25,  // 第一盘 主队 网球, 排球
//   26,  // 第一盘 客队 网球, 排球
//   27,  // 第二盘 主队 网球, 排球
//   28,  // 第二盘 客队 网球, 排球
//   29,  // 第三盘 主队 网球, 排球
//   30,  // 第三盘 客队 网球, 排球
//   31,  // 第四盘 主队 网球, 排球
//   32,  // 第四盘 客队 网球, 排球
//   33,  // 第五盘 主队 网球, 排球
//   34,  // 第五盘 客队 网球, 排球
//
//   35,  // 让分盘 主队 乒乓球, 排球
//   36,  // 让分盘 客队 乒乓球, 排球
//
//   37,  // 第1局 主队 乒乓球
//   38,  // 第1局 客队 乒乓球
//   39,  // 第2局 主队 乒乓球
//   40,  // 第2局 客队 乒乓球
//   41,  // 第3局 主队 乒乓球
//   42,  // 第3局 客队 乒乓球
//   43,  // 第4局 主队 乒乓球
//   44,  // 第4局 客队 乒乓球
//   45,  // 第5局 主队 乒乓球
//   46,  // 第5局 客队 乒
//
